[
{"Training language": "Tiếng Anh", "Admission code": "FL2", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": 60}, "2021": {"Talent recruitment": null, "Admissions targets": 70}, "2022": {"Talent recruitment": null, "Admissions targets": 70}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 110}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 90}}, "Description_1": "\n                                \n                                    Graduated: Bachelor - Master\n                                    Admissions Time: August every year\n                                    Training time: 4 years (8 semesters) - 6 years\n                                    Tuition: 45 - 50 million VND/year\n                                \n                                International Professional English (IPE) Bachelor's Program:\n\nTraining high-quality human resources in the field of English Language to meet the needs of agencies, organizations, and businesses, serving the requirements of socio-economic development, ensuring national defense, security and society. international import;\nTraining learners with solid basic and professional knowledge, research capacity and creativity, professional practice skills, professional responsibility, political qualities, and adaptability. adapt to the international working environment to be able to work effectively, meet society's requirements in the process of international integration and be able to continue studying at a higher level.\nTraining language: English\n\nAdmission form\n\nTalent recruitment (Direct admission)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of the Thinking Assessment Test\n\n                            ", "Description_2": "\n                            Training Program\n                            Detailed training program information -  DOWNLOAD PDF\n                        \n                            Tuition - Scholarships\n                            \nIn addition to the University's scholarships and financial support, IPE Bachelor program students have the opportunity to receive:\n03 scholarships for excellent students, total value 15,000,000 VND/year\n\n                        \n                            Careers\n                            \n94.3% of students have jobs after 1 year of graduation with an average salary of 7-10 million VND/month.\n\nSuitable job position:\n\nUndertake work at embassies, governmental and non-governmental organizations, projects, and domestic and foreign businesses.\nTeaching at high school and university educational institutions.\nWork at media and press organizations. Do research work at language and educational organizations.\nDo research work at language and educational organizations.\nStart a business and join technology startups.\nContinue studying at a higher level in the field of languages ​​as well as other social sciences and humanities fields.\n\n                        ", "Management": "\n                            Management Unit\n                            Viện Ngoại Ngữ\n                            \n                                Address: Phòng 209,  nhà D4 - ĐH Bách Khoa Hà Nội, Số 1, Đại Cồ Việt, Q.Hai Bà Trưng, Hà Nội\n                                Hotline: \n                                    (+84) 24 3869 2201\n                                    \n                                Email: sofl@hust.edu.vn\n                                Website: https://sofl.hust.edu.vn/\n                            \n                        "},
{"Training language": "English", "Admission code": "BF-E19", "Recruiement": {"2020": {}, "2021": {}, "2022": {}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                The Advanced Program in Bioengineering (Elitech KTSH) starts enrollment in 2023 with the goal of creating high-quality human resources in Bioengineering oriented in the field of Medicine and Pharmacy and towards international integration - global citizenship. This is also a key content of the priority orientation on science and health of HUST.\n                            ", "Description_2": "\n                            Training Program\n                            For more information about the training program, click here\nWhat does the Bioengineering Elitech Program - Hanoi University of Science and Technology provide for learners?\n\nBasic and core knowledge of Biotechnology, supporting technologies and techniques to match the application orientation in Medicine - Pharmacy.\nSkills to participate in the organization of production, participate in the design and evaluation of technological solutions, equipment and quality of biological products.\nSkills, knowledge of identifying and identifying technical problems, researching and developing products/technology solutions.\nProject planning and problem-solving skills.\nProficient English language skills in communication and professional work, towards becoming a global citizen.\nSkills to develop yourself in a globalized environment.\n\nJob Opportunities\n\nThe ability to use English in communication and professionalism will be an advantage to work in international businesses/organizations with competitive salaries.\nWorking at enterprises, companies, manufacturing plants, research units, international organizations in the fields of health and pharmaceuticals; In addition, they can also work in food, industry, agriculture, environment;\nWorking at foreign enterprises, multinational companies, manufacturing plants, domestic and foreign research units;\nParticipate in teaching, research and development of technology, product development in the field of biotechnology, healthcare, pharmaceuticals and food at universities and research institutes;\nDevelopment of technologies for the production of biotechnology products; organize, manage and administer production; technology consulting; trading in biological products for health and pharmaceuticals;\nOperation and maintenance of biotechnology equipment and related fields;\nDesign consultancy, supervision at technological processes, biotechnology equipment.\n\nScholarship opportunities, academic support\n\nSimilar to students of the standard KTSH program, but with the language of learning in English oriented to Medicine and Pharmacy, with the teaching participation of foreign lecturers, the opportunity to receive scholarships to study and exchange abroad will be prioritized.\nSmall class sizes with learners-centered will be more convenient in the learning process and receive closer advice from teachers, academic advisors and administrators.\nStudents with excellent academic achievements are prioritized for short-term exchange abroad, receive scholarships to practice from 3-6 months in Japan, Korea, USA,...\nGood and good graduates are prioritized to be introduced to study masters in countries such as Japan, Korea, the Netherlands, Germany, France, Italy, Australia, New Zealand,...\n\n\nSee also Comparison table of training programs\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Hóa và Khoa học sự sống\n                            \n                                Address: Phòng 214, nhà C4, Đại Cồ Việt, Hai Bà Trưng, Hà Nội\n                                Hotline: \n                                    024 38 680 070\n                                     & 024 3869 2300\n                                Email: sce@hust.edu.vn\n                                Website: https://chemeng.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Đức tăng cường", "Admission code": "ET-LUH", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor - Master\n                                    Admissions Time: April - August every year\n                                    Training time: 4 - 5.5 years\n                                    Tuition: 55 - 65 million VND/year\n                                \n                                 \n\n\n\n\n\n \nCOOPERATION TRAINING PROGRAM WITH LEIBNIZ HANNOVER UNIVERSITY \n– GERMANY Universitaet Leibniz Hannover (LUH)\n \n\n\n\n\n\nTRAINING INDUSTRY\nStudied at Hanoi University of Science and Technology: Electronic Engineering - Telecommunications\nTransfer to study Stage 2 at LUH: Electricity - Electronics and Information Technology\nTraining major: Electronics and Communications Engineering\nINTRODUCTION TO LEIBNIZ HANNOVER UNIVERSITY\nAddress: Leibniz Universität Hannover, Welfengarten, D-30167 Hannover, Germany\nTel.  +49 511 762 – 0\nFax  +49 511 762 – 3456\nE-mail    kommunikationuni-hannover.de\nWebsite:           https://www.uni-hannover.de/\nFounded in 1831, Leibniz University Hannover is a modern university and internationally recognized for the quality of its basic and applied scientific research. Teaching is conducted with modern equipment and based on the latest research results, associated with technical application projects in industrial production. Leibniz University Hannover has about 2,000 scientists participating in teaching and research in 17 faculties with 160 affiliated institutes. The school provides training in the fields of Engineering and Natural Sciences with training levels of Engineer, Master and Doctor. Every year the School attracts a large number of international students from hundreds of different countries, accounting for 12% of the total student population of the School.\n\nLUH cooperated with Hanoi University of Science and Technology to deploy training in Mechatronics Engineering since 2002, and in 2011 deployed training in Electronics - Telecommunications. The Electronics - Telecommunications industry is managed by the Faculty of Electrical Engineering and Computer Science of LUH. Currently, the Faculty has about 40 professors and 300 lecturers and researchers in 16 institutes and 27 research fields with more than 1,500 students (including more than 400 international students) studying.\nLeibniz University Hannover is located in the city center of Hannover in central Germany, famous for its festivals, cultural activities and international trade fairs held annually. Here, you will meet a large community of Southeast Asian people studying and living. For the above reasons, Leibniz University Hannover is the ideal destination for Vietnamese students, especially those studying science and technology, in establishing a foundation for future career development.\n? Training language: Vietnamese enhanced with German\nGeneral introduction to the program - SEE HERE\nAdmission form\n\nDirect admission (Talent admission)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of a thinking test\n\n                            ", "Description_2": "\n                            Training Program\n                            TRAINING METHODS AND DEGREES\n? Phase 1 (4 years): Students study at Hanoi University of Science and Technology according to the unified curriculum between Hanoi University of Science and Technology and Leibniz University Hannover (LUH). Students learn German intensively.\n? Phase 2 (1 - 2 years): there are 02 options:\n\nOption 1 (2 years): Students with CPA > 2.6 and B1 German certificate will be transferred to phase 2 to receive a Master's degree in engineering from LUH according to your school's regulations. Hanoi University of Science and Technology and LUH will support procedures for applying for passports, entry visas to Germany, and opening personal accounts in Germany for students to study in Germany.\nOption 2 (1.5 years): Students who do not transfer to LUH can continue to study at Hanoi University of Science and Technology according to the Master's program of Hanoi University of Science and Technology.\n\nEDUCATION PROGRAM\nDetailed training program framework - LUH (Bachelor's degree)\nThe Electronics - Telecommunications engineering program in cooperation with LUH is built and targets the fields of training in electronic engineering, digital electronics, microprocessor engineering, signals and systems, and combined digital information. The ability to exploit and use modern methods and tools to design and evaluate electronic systems, telecommunications, processes and technical products in the field of Electronics - Communications. \nTo promptly update with the latest and most advanced technologies requires good reading and writing foreign language skills because information about them is written in English, German... Due to the characteristics of high workload and complexity, The Electronics - Telecommunications industry must both develop independent research ability and hone teamwork skills. Therefore, experiencing the German language environment according to international standards when studying at the Institute of International Training, Hanoi University of Science and Technology will create a good foundation and favorable conditions for future engineers to adapt to job requirements. .\nAfter graduating, students can work immediately at foreign companies and enterprises. Telecommunications Engineers undertake work in many different fields: research and development, wireless networks, positioning. navigation, multimedia signal equipment for sound and images... make devices and systems more convenient, simpler and more effective to meet human and social needs.\nContact consultants specializing in post-IT training:\nDirector of Training Program: Associate Professor, PhD. Nguyen Tien Hoa;\nEmail: hoa.nguyentien@hust.edu.vn; \nPhone: 0934.516862\n \n                        \n                            Tuition - Scholarships\n                            TRANSITION CONDITIONS\nStudents can transfer to Leibniz University Hannover if they meet the following conditions:\n\nGraduated with a bachelor's degree from Hanoi University of Science and Technology (ie completed 4 years of phase 1)\nPassed the entrance exam of Leibniz University Hannover\nPass German TesDaf 4×3\n\nStudents studying abroad are given the opportunity to work more in scientific research support activities for 37 hours/month; Income level is 7.5 Euro/hour. After graduation, you will have the opportunity to sign legal labor contracts with businesses in Germany to train and accumulate more experience for a certain period of time.\nIn addition, Leibniz University Hannover also has 2-week summer courses (in July and August every year) for students who wish to go into practice.\nTRAINING FEE\n\nStudy at Hanoi University of Science and Technology: ~ 55-65 million VND/academic year\nStudy in Germany: The German Ministry of Education applies a tuition-free policy for international students. Students only have to pay admission fees for 1 semester (100 - 120 EURO) and living expenses.\n\nCONTACT COORDINATOR\n\nFull name:      Assoc.Prof. Dr. Nguyen Huu Thanh\nCurrent position:    Director of the Institute of Electronics and Telecommunications, Hanoi University of Science and Technology\nPhone:             091 252 3624\nGraduated with a PhD from Leibniz University Hannover.\n                        \n                            Careers\n                            98% of students have jobs after 1 year of graduation\nIn Germany, the average salary for a mechatronics bachelor is 2050 EURO (According to www.mechatroniker.me) \nTHE FUTURE OF THE ELECTRONICS - TELECOMMUNICATIONS INDUSTRY AND CAREER OPPORTUNITIES\nNot only companies in the field of Electronics - Telecommunications such as Viettel, VNPT, FPT, Samsung but countless companies need to use Telecommunications network infrastructure. Transport Engineers can undertake the following tasks: \n\nTechnical design and operation at radio stations, television stations, telecommunications network design consulting companies, Electronics - Telecommunications equipment manufacturing, microchip manufacturing\nResearch, design, operate 3G/4G/5G/6G mobile networks as well as program radio network features\nResearch and development of radio networks, navigation, audio, image and video multimedia signal processing equipment\n\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "BF-E12", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Integrated Masters – PhD (NCS)\n                                    Admissions Time: 4 – 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \nFood Engineering Advanced Program\n\nThe integrated bachelor - master program orients the high-quality labor market in the food sector of Vietnam and Southeast Asia as well as meeting the requirements of globalized markets (FDI, ASEAN, CPTPP);\nThe program is designed and references advanced programs at renowned universities in Europe (Belgium, Germany, the Netherlands, France) and Asia (Korea, Japan) in food engineering ensuring students have interdisciplinary and in-depth knowledge and skills in the food sector including Technology + Equipment + Quality + Management;\nStudents can study, practice and participate in scientific research with the condition of Vietnam's leading modern and synchronous facilities, practice and research equipment in the field of food, as well as practical experience in the production environment of food enterprises as well as internships at famous universities in Europe ( Belgium, Germany, Netherlands, France) and Asia (Korea, Japan);\nStudents are focused on perfecting \"soft\" skills such as presentation, communication, teamwork, working in an international environment, interacting and exchanging with many students, professors, experts from developed countries: Austria, Belgium, France, Germany, Japan, Korea... and especially study and exchange in English.\n\nAdmission form\n\nDirect Selection (Talent Screening)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of the Thinking Assessment Exam\n\n                            ", "Description_2": "\n                            Training Program\n                            Training Program Information: SEE HERE\nApply for the Advanced Program\n\nCandidates apply for admission to Advanced programs according to the registration codes in the table above. Depending on the situation, the University may continue to organize additional admissions to advanced programs from new students who have enrolled according to their wishes, with priority given to candidates with good English proficiency. Students with limited English proficiency must take intensive foreign language lessons in the first year of study. Students who achieve IELTS level 6.0 or higher are given priority to immediately study some modules of the 2nd year level.\nThe tuition fee of the Advanced program for the new course K62 is equal to 1.4 – 1.6 times the regular university tuition fee in the same discipline.\n\n                        \n                            Tuition - Scholarships\n                            \nScholarships for internships, exchanges, training of undergraduate and postgraduate students with famous universities in Europe (Belgium, Germany, the Netherlands, France) and Asia (Korea, Japan), training and research cooperation programs of Europe, Asia and at partner enterprises;\nTalent scholarships, research scholarships of HUST, study promotion scholarships of alumni/lecturers of the Institute of Science and Technology;\nScholarships to transfer to postgraduate training programs (Masters, PhD) at Hanoi University of Science and Technology as well as at famous partner universities in Europe (Belgium, Germany, Netherlands, France) and Asia (Japan, Korea).\n\n                        \n                            Careers\n                            \nWorking at domestic, joint venture, FDI enterprises in technical research and development, equipment for the production of food products, designing, operating and controlling production lines, organizing and operating production, managing technology and quality in the field of food industry;\nConsulting, investment and technology transfer in the field of food industry;\nWorking at international organizations as well as state management agencies, ministries and departments;\nParticipate in teaching and research at universities, colleges, research institutes in the field of food.\nDue to their proficient foreign language ability and strong professional knowledge, graduates of the Advanced Program have many job opportunities at economic corporations, large domestic enterprises and international working environment, or receive scholarships to continue their studies to higher levels abroad.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Hóa và Khoa học sự sống\n                            \n                                Address: Phòng 214, nhà C4, Đại Cồ Việt, Hai Bà Trưng, Hà Nội\n                                Hotline: \n                                    024 38 680 070\n                                     & 024 3869 2300\n                                Email: sce@hust.edu.vn\n                                Website: https://chemeng.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "CH-E11", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Integrated Masters – PhD (NCS)\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \nPharmaceutical chemistry is a science that combines organic and biochemical chemistry, pharmacology, molecular biology and physical chemistry to research, develop and produce pharmaceutical products. Medicinal chemistry includes the extraction, discovery, identification of substances of natural origin and synthesis of new biologically active substances, the study of metabolism, the explanation of the mechanism of their action at the molecular level, the construction of relationships between the structure and biological effects or pharmacological effects. On that basis, build testing processes and technological processes and lines of drug production equipment for human treatment.\nAdvanced Pharmaceutical Chemistry Engineering Program by Hanoi University of Science and Technology in cooperation with University of Adelaide (Australia)\n\nThe University of Adelaide is a Top 8 Australian university, ranked 106th in the QS World University Ranking and Times Higher Education world university rankings worldwide. Based on the cooperation agreement between the two universities of Adelaide – and Hanoi University of Science and Technology signed in 2019, the Advanced Program in Pharmaceutical Chemistry (belonging to the Elitech program group - Admission code CH-E11) is built according to the 2+2 model and starts enrolling students from 2019. Due to the similarity in the structure and content of the training program, taught entirely in English, students after studying for 2 years in Vietnam, if they have financial conditions and a minimum English level of IELTS 6.0, can completely study for the next 2 years to get a Bachelor's degree from the University of Adelaide and continue their studies higher.\n\nCompared to studying abroad in Australia by themselves from the first year, students enrolled in the advanced program of pharmaceutical chemistry can save up to 50% of study abroad costs (due to the first 2 years of studying in Vietnam), and enjoy incentives for partner universities with annual tuition fee reductions of up to 30%. Students who do not come to Australia can complete the integrated Bachelor-Master program for a Master's degree from Hanoi University of Science and Technology. With good English proficiency and solid in-depth knowledge of pharmaceutical chemistry, process engineering and chemical technology equipment, graduates can meet the demand for highly qualified labor in research and development as well as process technology of drug production, dietary supplements and cosmetics.\n\nASS. Vu Dinh Tien - PVT Institute of Chemistry during his working trip to the University of Adelaide\nAdmission form\n\nDirect Selection (Talent Screening)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of the Thinking Assessment Test\n\n                            ", "Description_2": "\n                            Training Program\n                            Detailed Training Program - SEE HERE\nFor more information about the program, please contact:\n\n Prof. Vu Dinh Hoang\n Email: hoang.vudinh@hust.edu.vn\n\n                        \n                            Tuition - Scholarships\n                            Scholarship information, please contact the Specialized Institute\nINSTITUTE OF CHEMICAL ENGINEERING\n\nDeputy Director - Dr. Nguyen Ngoc Tue \nEmail: tue.nguyenngoc@hust.edu.vn\nPhone: 0976545519\nAddress: Room 213 - C4, Hanoi University of Science and Technology, No. 1 Dai Co Viet, Hai Ba Trung District, Hanoi\nPhone: 024 3869 2300 / 024 3868 3797\nEmail: sce@hust.edu.vn\nHotline: 0868 692 300\nWebsite: http://chemeng.hust.edu.vn/tuyensinh\nFB: facebook.com/ tuyensinhkthh\n\n                        \n                            Careers\n                            - Lecturers at domestic universities and colleges majoring in Pharmaceutical Chemistry\n- Researcher at research institutes such as Vietnam Academy of Science and Technology, Vietnam Institute of Industrial Chemistry, National Institute of Medicinal Herbs\n- Technicians, product research and development, quality supervision, production management at companies producing and trading pharmaceuticals, functional foods, cosmetics ...\n                        ", "Management": "\n                            Management Unit\n                            Trường Hóa và Khoa học sự sống\n                            \n                                Address: Phòng 214, nhà C4, Đại Cồ Việt, Hai Bà Trưng, Hà Nội\n                                Hotline: \n                                    024 38 680 070\n                                     & 024 3869 2300\n                                Email: sce@hust.edu.vn\n                                Website: https://chemeng.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "EE-E18", "Recruiement": {"2020": {}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 50}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 50}}, "Description_1": "\n                                \n                                    Graduated: Bachelor\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                The Advanced Program of Power Systems and Renewable Energy of the Institute of Power is a new training program, spun off from the Advanced Program of Control – Automation and Power Systems to meet the huge demand for high-quality and well-trained human resources\nThe advanced program Power Systems and Renewable Energy under the code of Electrical Engineering of Hanoi University of Science and Technology is built based on the training program in Electrical Engineering, specializing in power systems and renewable energy of Australian and American universities. Some modules of the curriculum will be taught by reputable foreign professors. Students enrolled in the Advanced Power Systems and Renewable Energy program have many benefits: the opportunity to participate in research labs early; opportunities to receive valuable scholarships from companies and businesses; have the opportunity to participate in student exchange programs, technical internships at prestigious universities and companies at home and abroad\nAdmission form\n- Talent Selection (Direct Admission)\n- Admission based on high school graduation exam results\n- Admission is based on the results of the Thinking Assessment Test\n                            ", "Description_2": "\n                            Training Program\n                            Detailed Training Program Information - SEE HERE\nIn charge of in-depth consulting on e-commerce:\n\nEE-E18 – Power Systems and Renewable Energy (Advanced Program)\nDirector of Investment: Dr. Nguyen Duc Tuyen\nEmail: tuyen.nguyenduc@hust.edu.vn\nPhone: 0986 509059\n\n                        \n                            Tuition - Scholarships\n                            [ Updating]\n                        \n                            Careers\n                            - Operators at national power system dispatch centers, regional dispatchers, power plants, provincial/city power companies, solar and wind power projects;\n- Design staff at power design consultancy companies, electrical installation, thermal power plants, hydropower, wind power, solar power; state-owned enterprises in charge of electrical safety regulations under the Ministry of Industry and Trade and the Ministry of Construction;\n- Companies designing and researching solutions for smart grid, automation of power systems;\n- Staff researching, designing and operating at domestic and foreign corporations in the field of power systems and renewable energy;\n- Researchers, teaching staff at universities and research institutes.\n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "ME-LUH", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 50}}, "Description_1": "\n                                \n                                    Graduated: Bachelor - Master\n                                    Admissions Time: April - August every year\n                                    Training time: 4 - 6 years\n                                    Tuition: 55 - 65 million VND/year\n                                \n                                 \n\n\n\n\n\n \nCOOPERATION TRAINING PROGRAM WITH LEIBNIZ HANNOVER UNIVERSITY\n – GERMANY Universitaet Leibniz Hannover (LUH)\n \n\n\n\n\n\nTRAINING INDUSTRY\nStudied at Hanoi University of Science and Technology:Mechatronics \nTransfer to study stage 2 at LUH: Mechatronics\nTraining major: Mechatronics\nINTRODUCTION TO LEIBNIZ HANNOVER UNIVERSITY\nAddress: Leibniz Universität Hannover, Welfengarten, D-30167 Hannover, Germany\nTel.  +49 511 762 – 0\nFax  +49 511 762 – 3456\nE-mail    kommunikationuni-hannover.de\nWebsite:           https://www.uni-hannover.de/\nFounded in 1831, Leibniz University Hannover is a modern university and internationally recognized for the quality of its basic and applied scientific research. Teaching is conducted with modern equipment and based on the latest research results, associated with technical application projects in industrial production. Leibniz University Hannover has about 2,000 scientists participating in teaching and research in 17 faculties with 160 affiliated institutes. The school provides training in the fields of Engineering and Natural Sciences with training levels of Engineer, Master and Doctor. Every year the School attracts a large number of international students from hundreds of different countries, accounting for 12% of the total student population of the School.\n\nUH cooperated with Hanoi University of Science and Technology to deploy training in Mechatronics Engineering since 2002, and in 2011 deployed training in Electronics - Telecommunications. The Electronics - Telecommunications industry is managed by the Faculty of Electrical Engineering and Computer Science of LUH. Currently, the Faculty has about 40 professors and 300 lecturers and researchers in 16 institutes and 27 research fields with more than 1,500 students (including more than 400 international students) studying.\nLeibniz University Hannover is located in the city center of Hannover in central Germany, famous for its festivals, cultural activities and international trade fairs held annually. Here, you will meet a large community of Southeast Asian people studying and living. For the above reasons, Leibniz University Hannover is the ideal destination for Vietnamese students, especially those studying science and technology, in establishing a foundation for future career development.\nGeneral introduction to the program - SEE HERE\nTraining language: Vietnamese\n Admission form:\n- Talent selection (Direct admission)\n- Admission is based on the results of the high school graduation exam\n- Admission is based on the results of a thinking test\n                            ", "Description_2": "\n                            Training Program\n                            Detailed information about the training program: SEE HERE\n                        \n                            Tuition - Scholarships\n                            TRANSITION CONDITIONS \nStudents can transfer to Leibniz University Hannover if they meet the following conditions:\n\nGraduated with a bachelor's degree from Hanoi University of Science and Technology (ie completed 4 years of phase 1)\nPassed the entrance exam of Leibniz University Hannover\nPass German TesDaf 4×3\nThe German Ministry of Education applies a tuition-free policy for international students. Students only have to pay one semester's admission fee (100 - 120 EURO) and living expenses.\n\nStudents studying abroad are given the opportunity to work more in scientific research support activities for 37 hours/month; Income level is 7.5 Euro/hour. After graduation, you will have the opportunity to sign legal labor contracts with businesses in Germany to train and accumulate more experience for a certain period of time.\nIn addition, Leibniz University Hannover also has 2-week summer courses (in July and August every year) for students who wish to go into practice.\nTRAINING FEE\n\nStudy at Hanoi University of Science and Technology: ~ 55-65 million VND/academic year \nStudy in Germany: The German Ministry of Education applies a tuition-free policy for international students. Students only have to pay admission fees for 1 semester (100 - 120 EURO) and living expenses. \n\nCONTACT COORDINATOR\nCurrent position:   Deputy Director of the Institute of Mechanical Engineering, Hanoi University of Science and Technology \nPhone: \nGraduated with a PhD from Leibniz University Hannover.\n                        \n                            Careers\n                            98% of students have jobs after 1 year of graduation \nIn Germany, the average salary for a mechatronics bachelor is 2050 EURO (According to www.mechatroniker.me)\n                        ", "Management": "\n                            Management Unit\n                            Trường Cơ khí\n                            \n                                Address: VP C7-614M, ĐH Bách khoa Hà Nội, số 1 Đại Cồ Việt, Hà Nội\n                                Hotline: \n                                    (+84) 24 38 696 165\n                                    \n                                Email: sme.hust.edu.vn\n                                Website: https://sme.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Việt", "Admission code": "ME-NUT", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 90}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}}, "Description_1": "\n                                \n                                    Graduated: Engineering\n                                    Admissions Time: April - August every year\n                                    Training time: 5 years\n                                    Tuition: 55 - 65 million VND/year\n                                \n                                 \n\n\n\n \n\n \nTRAINING COOPERATION PROGRAM WITH NAGAOKA UNIVERSITY OF TECHNOLOGY \n–JAPAN Nagaoka University of Technology (NUT)\n \n\n \n\n\n\nTRAINING INDUSTRY\nStudied at Hanoi University of Science and Technology: Mechatronics Engineering\nTransfer to study stage 2 at NUT: Mechanical\nINTRODUCTION TO NAGAOKA UNIVERSITY OF TECHNOLOGY, JAPAN\n           \n             Address:            Nagaoka University of Technology \n                                    1603-1 Kamitomiokamachi, Nagaoka, Niigata Prefecture 940-2137, Japan\n            Phone:       +81 258-46-6000\n            Website:           http://www.nagaokaut.ac.jp\n            \nNagaoka University of Technology (NUT) is one of Japan's leading public technical universities, established in 1976 in Nagaoka city, Niigata prefecture. With the GIGAKU spirit of training a new generation of engineers who have the ability to creatively approach and promote the industrial achievements left by previous generations, Nagaoka University of Technology is a reliable address for Students love science and technology. In order to create an international training environment, NUT has a policy to encourage foreign students to study and research at the school.\n          \nNUT cooperates with Hanoi University of Science and Technology to implement cooperative training in Mechatronics Engineering since the establishment of the International Training Cooperation Program in 2002. This is the only formal university training cooperation program for Up to now, students are equipped with both professional knowledge and Japanese in the field of Mechatronics. Over twenty consecutive years, the Mechatronics Engineering training cooperation program has now expanded its cooperation with schools in the Japan Consortium of Technical Universities (Japan Consortium Technology – JCT: including universities Nagaoka Technology, Gunma University, Toyohashi University of Technology, Nagoya Institute of Technology and Gifu University). To date, more than 200 students from Hanoi University of Science and Technology have received scholarships and transferred to study at Nagaoka University of Technology and schools in the Association.\n\n       \nTransfer students born in Japan and continuing their studies from the third year have the opportunity to enjoy Japan's beautiful cherry blossom season in April, as well as study and grow in a favorable social environment. discipline, high mechanical automation. They will become engineers, a bridge not only in the technical field but also in culture between Vietnam and Japan. \nGeneral introduction to the program - SEE HERE\n \nAdmission form:\n-  Talent selection (Direct admission)\n- Admission is based on the results of the high school graduation exam\n- Admission is based on the results of a thinking test\n                            ", "Description_2": "\n                            Training Program\n                            Detailed information about the training program: SEE HERE\n                        \n                            Tuition - Scholarships\n                            In addition to scholarships and financial support from Hanoi University of Science and Technology, students majoring in Mechatronics Engineering - International Cooperation Program with Nagaoka University have the opportunity to receive:\n\n15-18 scholarships from companies and the Japanese Government (applies to qualified students to study in Japan). \n\nTRANSITION CONDITIONS \nCumulative average total of the first 4 semesters (first 2 years) >= 2.3\nComplete 05 consecutive Japanese courses\nPass the interview and professional test directly organized by schools in the Japan Consortium Technology Association.\nTRAINING COST: about 50 - 60 million/year\nCONTACT COORDINATOR\nIf you have any questions or need advice, please contact the Coordinator\n\nFull name, Academic title, Degree: Associate Professor. Dr. Nguyen Thi Phuong Mai \nCurrent position: Lecturer at Institute of Mechanical Engineering - Hanoi University of Science and Technology\nPhone: 091 3345 972 \nPost-doctoral internship at Nagaoka University, former Director of the Institute of International Training.\n                        \n                            Careers\n                            \nOver 98% of students have jobs after 1 year of graduation with a common salary of 10-15 million VND/month.\n\nTypical job positions:\n\nResearch, design, manufacture, production management, and operations at factories of domestic and international enterprises and corporations related to the field of mechatronics and mechanical engineering;\nBecome a lecturer and researcher at universities and research institutes; \nThere are many opportunities to receive scholarships for postgraduate study and research at domestic and foreign universities.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Cơ khí\n                            \n                                Address: VP C7-614M, ĐH Bách khoa Hà Nội, số 1 Đại Cồ Việt, Hà Nội\n                                Hotline: \n                                    (+84) 24 38 696 165\n                                    \n                                Email: sme.hust.edu.vn\n                                Website: https://sme.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Nhật tăng cường", "Admission code": "IT-E6", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 240}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 240}}, "Description_1": "\n                                \n                                    Graduated: Integrated Bachelor - Master\n                                    Admissions Time: August every year\n                                    Training time: 4 - 5.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                ELITECH TRAINING PROGRAM\nVIETNAM - JAPAN INFORMATION TECHNOLOGY (HEDSPI)\nThis is the program in which graduates have the highest average salary among IT-related training majors at Hanoi University of Science and Technology. 70% of graduates go to work in Japan, and currently, Viet Nhat IT (HEDSPI) has become a very prestigious brand in the Japanese labor market.\nWithin the framework of the Project to Support the Development of Undergraduate and Postgraduate Training in ICT (HEDSPI Project) in cooperation between the Governments of Vietnam and Japan, in 2006, Hanoi University of Science and Technology opened the IT Engineer Program. Viet Nhat (referred to as: HEDSPI IT Program) trains IT engineers with qualifications equivalent to engineers trained at IT universities in Japan. From 2021, the Viet Nhat IT engineer program will switch to an integrated training model. After graduating, students can graduate with a bachelor's degree, or transfer to engineering and master's degrees.\nAfter graduation, HEDSPI IT bachelors can be recruited to work in Japan immediately with the same job position and income as Japanese IT graduates. As for the Japanese foreign language, during the learning process, students learn directly from Japanese lecturers, in addition, many specialized subjects are also taught by Japanese professors and experts from universities. and reputable businesses, this ensures students have sufficient foreign language proficiency to work in Japan.\nAdmission form\n\nTalent recruitment (Direct admission)\nAdmission is based on high school graduation exam results \nAdmission is based on the results of the Thinking Assessment Test\n\n                            ", "Description_2": "\n                            Training Program\n                            \nDetailed training program   DOWNLOAD PDF\n\n\n\n\n\n\n\n\n\n\n\n \n                        \n                            Tuition - Scholarships\n                            Major scholarships and financial aid\nIn addition to the main source of scholarships and financial support from Hanoi University of Science and Technology, students enrolled in the HEDSPI Program with good academic results have the opportunity to receive talent money from the Alumni Association / IT Business Association Scholarship Fund. or from large corporations such as Microsoft, Samsung, VinGroup, VNPT...\nIn addition, students with good teaching and research abilities can participate as learning support (Teaching Assistant - TA, supporting lecturers), or research support (Research Assistant - RA, supporting and do research together with teachers at the School's laboratory system) with the ability to pay up to 4 million/month, accompanied by proof of the School's official formula so that students can later Favorable conditions for applying for scholarships to study abroad. Currently, the School is the only unit developing these programs within the School.\nIntegrated study of multi-level training: students have the opportunity to receive tuition reduction scholarships from the School, scholarships to support post-graduate training from domestic and foreign corporations and corporations.\nStudent exchange scholarships and internship opportunities\nAs part of the Elitech Programs, the HEDSPI Program regularly invites lecturers from Japan or other countries to teach students. In addition, the Institute cooperates with Japanese universities, helping students have the opportunity to exchange and get early exposure to the Japanese working environment, such as Aizu University, Tokyo University of Technology... \nDuring the course, students at the School get to practice and experience the real working environment at more than 200 of the School's partner businesses, including many Japanese businesses based in Vietnam.\n                        \n                            Careers\n                            100% of students have jobs after 1 year of graduation.\nTypical job positions\n\nTeam leader in large Japanese, American, European corporations, in international projects.\nActing as a bridge engineer for large companies in Vietnam towards the Japanese market.\n70% of graduates work at Japanese companies in Japan with a starting salary of 50-60 million VND/month, especially up to more than 100 million/month.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Công nghệ thông tin và Truyền thông\n                            \n                                Address: Văn phòng Trường CNTT&TT (P505 - Nhà B1)\n                                Hotline: \n                                    024 3869 2463\n                                    \n                                Email: vp@soict.hust.edu.vn\n                                Website: https://soict.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Việt", "Admission code": "IT-EP", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor\n                                    Admissions Time: April - August every year\n                                    Training time: 5.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \nVIET PHAP INFORMATION TECHNOLOGY TRAINING PROGRAM\n\nThis program inherits the decades-old tradition of training cooperation between Hanoi University of Science and Technology and traditional partners from the French Republic, as well as other advanced countries of the Francophone Community (Belgium, Canada, Switzerland). Switzerland, Luxembourg...). The program inherits the advantages of the High Quality Engineer Training Program (PFIEV) and updates the content in accordance with the development orientation of the field related to Industry 4.0 and Digital Transformation. Students participating in the program have a great opportunity to transfer to the 4+2 model at Grenoble Polytechnic Institute to graduate with the prestigious Engineering or Master's degree of the French Republic, thereby opening up career opportunities. work or study in Europe, as well as advanced countries in the Francophone Community.\nTraining languages: Vietnamese, Intensive French\nAdmission form\n-Talent selection (Direct admission)\n- Admission is based on the results of a thinking test\n                            ", "Description_2": "\n                            Training Program\n                            Detailed information about the training program: SEE HERE\n                        \n                            Tuition - Scholarships\n                            Scholarships and financial aid\nIn addition to scholarships and financial support from Hanoi University of Science and Technology, students studying the Vietnam-France IT Program with good academic results have the opportunity to receive talent scholarships from the University, or from large corporations. such as Microsoft, Samsung, VinGroup, VNPT...\nIn addition, students with good teaching and research abilities can participate as teaching assistants (Teaching Assistant - TA, supporting teachers in teaching), or research assistants (Research Assistant - RA, supporting and Do research together with teachers at the School's laboratory system) with a remuneration of up to 4 million/month, accompanied by an official Certificate from the School so that students can have favorable conditions to apply for it in the future. scholarship. Currently, the School is the only unit implementing these programs within the School.\nIntegrated bachelor's and master's studies: students have the opportunity to receive tuition exemption scholarships from the University, scholarships to support postgraduate training from domestic and foreign corporations and corporations.\nStudent exchange scholarships and internship opportunities\nIn addition to exchanging and transitioning with the main partner: Grenoble INP, following this program, students still have the opportunity to exchange and get early exposure to the international working environment, through internships and exchanges. Exchange students with prestigious universities such as: Regensburg University of Applied Sciences (OTH, Germany), Nanyang Technical University (Singapore), National University of Singapore, Uppsala University (Sweden), Aizu University (Japan), Tokyo University of Technology (Japan)…\nDuring the course, students at the School get to practice and experience the real working environment at more than 200 of the School's partner businesses, including many international businesses headquartered in Vietnam. \nIn addition, the School's alumni network in Silicon Valley also regularly organizes support and consulting activities to help students have opportunities to exchange and intern at the world's leading technology corporations.\n                        \n                            Careers\n                            \nWorking in large corporations in France, Belgium, Canada, Switzerland...\nExcellent students have the ability to work in Silicon Valley, USA, through the support of the School of Information and Communications Technology alumni network in the USA.\nBeing a core engineer for large companies in Vietnam targeting foreign markets. \nHave the advantage of professional skills and foreign language ability to work directly with foreign partners.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Công nghệ thông tin và Truyền thông\n                            \n                                Address: Văn phòng Trường CNTT&TT (P505 - Nhà B1)\n                                Hotline: \n                                    024 3869 2463\n                                    \n                                Email: vp@soict.hust.edu.vn\n                                Website: https://soict.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "ME-GU", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor - Engineering\n                                    Admissions Time: April - August every year\n                                    Training time: 4 - 5 years\n                                    Tuition: 55 - 65 million VND/year\n                                \n                                The program of training bachelor - engineer in Mechanical Engineering Mechanics - International training program of Institute of Mechanical Engineering, Hanoi University of Technology in association with Faculty of Mechanical Engineering, Griffith University (Australia); Basic curriculum is designed based on Griffith School's Mechanical Mechanics program.\nStudents studying this field will be equipped with solid background and specialized knowledge, have the professional skills and research capacity to be able to work and be creative in all working environments to solve problems. deals with the design, manufacture, operation and maintenance of machines, mechanical equipment and industrial production systems that meet the needs of society, quickly adapt to the working environment of the world. industrial revolution 4.0.\nMain language of training: English\nIntroduction about the program - SEE HERE\nAdmission form\n\nDirect admission (Talent screening)\nAdmission is based on high school graduation exam results\nAdmission is based on thinking test results\n\nABOUT GRIFFITH UNIVERSITY\n\nFounded in 1971, Griffith University has gone through a long period of development and gradually established a system of campuses throughout the states of Australia. One of the top 300 universities in the world, one of Australia's top 10 universities. Griffith University is considered Australia's most innovative university in organizing, and one of the most influential universities in the Asia-Pacific region. School  Griffith University - Australia  (GU) is a university with a dynamic, multicultural learning environment with many large lecture halls, modern facilities, fully meeting all needs for learning and research of students. Currently, the University has more than 40,000 students from 124 different countries around the world. In addition to the solid theoretical foundation, all practical activities of the school always follow the reality, ensuring students easily find a job right after graduation. Focusing on training diverse academic levels, Griffith University always innovates and invests in different disciplines.\n\nSome outstanding achievements of the School:\n- Griffith University is in the TOP 3% of the best universities in the world ( Academic Ranking of World Universities ).\n- Being in the TOP 50 under 50 young universities with great innovation and improvement. (QS World University Rankings 2016)\n- Being voted 5 STARS on the results of students getting internships and jobs right after graduation. (QS Stars University Ranking 2017)\n\nCOOPERATION PROGRAM BETWEEN HANOI BUDGET UNIVERSITY AND GRIFFITH UNIVERSITY\n\nGriffith University cooperates with Hanoi University of Science and Technology to implement the training cooperation in Mechanical Engineering. GU and HUST agreed to cooperate in order to recognize each other's training programs. Students attending the program GU can forward in phase 2 (according to the model 3 + 2) of Level Degree and holds a  Bachelor of Mechanical Engineering  (Bachelor of Engineering (Honors) in Mechanical Engineering) at Griffith University (Gold Coast Campus)\n( https://degrees.griffith.edu.au/Program/1412/Overview/International )\nMechanical Engineer training program  designed for 5 years at Hanoi University of Technology, orienting students on careers, improving professional skills and foreign language proficiency, can be available. ready to meet the practical requirements for companies, enterprises at home and abroad, students can continue studying for a Master program at HCMUT.\nAfter graduating, graduates of mechanical engineering engineer cooperating with GU are accepted from companies in the fields of machine manufacturing, telecommunications, energy, robotics, AI, construction, mining ... best in Australia, get VISA to work in Australia for a long time. In Vietnam, students can hold positions such as Design Engineer, operator of hardware and software control systems for machines, automatic equipment, automatic production systems, and public consultants. technology, technical design, control programming, construction and transfer of automatic and semi-automatic lines and systems at mechanical, electrical and electronic companies; promoted to become Technical Director, Head of Technical Department at companies and businesses related to mechanics and electronics.\n\nHIGHLIGHTS\nWhy choose ME-GU program\n- The program is agreed between Hanoi University of Science and Technology and the partner school\nForeign lecturers and experts who come to teach each period have high professional qualifications\n- Modern learning method and abundant practical skills in factories, factories….\n- All cumulative courses at HCMUT are recognized after transfer\n- Study at HCMUT to receive a degree in Mechanical Engineering\n- Transfer to the program from the 3rd year - receive a Bachelor of Engineering from Griffith University.\n- The opportunity to receive a scholarship worth 7,000 AUS\n- Bachelor Degree (Hournors) in mechanical engineering from Griffith University, Australia recognized by the Australian Engineers Association \"Engineers Australia\"\n- Graduates can apply working visa for 2 years.\n- Cost savings: Social needs now need \"HOT\", 100% of graduates have jobs…. Students are encouraged to continue graduate study or stay to work in Australia ...\n                            ", "Description_2": "\n                            Training Program\n                            Training program framework  - DETAILS  \nKnowledge and skills gained after graduation\nKnowledge\n\nHas a broad and solid professional background, is well adapted to jobs that are relevant to the field of study, focuses on the applicability of basic knowledge and the core of mechanical engineering in combination with the ability to use public Modern tools for designing, manufacturing, operating, researching, analyzing, and improving machines, equipment or production systems.\n\nSkill\n\nProfessional work skills, personal qualities and social skills needed to be successful at work;\nCooperation, organization and multi-disciplinary teamwork skills;\nEffective communication skills through writing, presentations, discussions, effective use of modern tools and means;\nSkills to participate in research, design, manufacture, construction, operation, maintenance of technical systems / products / solutions in the field of mechanical engineering.\n\nForeign Language\n\nEffective use of English language in communication and work, achieving IELTS 5.5 points upon graduation, IELTS entry score of 4.5.\n\nTraining time and ability to study to higher education\n\nTraining Bachelor: 4 years\nTraining Bachelor - Engineer: 5 years\nStudents who meet the academic standards in the first 2 years will transfer to Griffith School from year 3.\n\n                        \n                            Tuition - Scholarships\n                            \nINTERNSHIP PROGRAM\nDuring the course of study at Hanoi University of Technology, students will be able to participate in internships at Mechanical Research Institutes; National and Military metrology centers; Designing and technology transfer institutes under the Ministry of Industry and Trade; Mechanical factories such as Auto Parts No. 1, Thang Long Metal, Viettel, Vinfast, Truong Hai; Foreign enterprises in Vietnam: Canon, Samsung, Toyota ...\n\n\nDuring the study at Griffith University - Australia, students will be arranged for an internship for 1 semester\nIn addition to the University's scholarships and financial support, students in Mechanical Engineering - International cooperation program with Griffith University have the opportunity to receive:\n\n7-10 scholarships from companies and the Australian Government (applicable to eligible students to study in Australia).\n\nTRANSITION CONDITIONS\nStudents must have a minimum GPA equivalent to a 4 on 7 scale.\nThe minimum English standards are as follows:\n\nAn IELTS (Academic) score above 6.0 and no skill below 5.5 or\nTOEFL score above 575 or\nTOEFL iBT score above 88 (no skill below 21), or\nNo skill below 3+ of the ISLPR exam\n\nStudents who do not meet English standards can enter the English language course at Griffith English Language Institute (GELI).\nTRAINING FEE\n\nIn Vietnam: About 50-60 million / year\nIn Australia: Tuition:  AU $ 32,200 / 1 year ; Living expenses:  AU $ 18,000 / year (transfer students can apply for scholarships worth AU $ 7,000)\n\nCONTACT COORDINATOR\nIf you have any questions or need advice, please contact the Coordinator\n\nFull name, Academic degree, Degree:  Assoc. TS. Nguyen Thi Phuong Mai\nCurrent position:  Lecturer of Institute of Mechanical Engineering - Hanoi University of Science and Technology\nPhone:  091 3345 972\n                        \n                            Careers\n                            Typical job position\n\nEngineers design, manage and operate at factories, enterprises, domestic and international corporations in the field of mechanical engineering;\nBecome lecturers and researchers at universities, research institutes, state agencies;\nContinue to study and research graduate at domestic and foreign universities.\nGraduates in Australia will be allowed to work for a minimum of 2 years.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Cơ khí\n                            \n                                Address: VP C7-614M, ĐH Bách khoa Hà Nội, số 1 Đại Cồ Việt, Hà Nội\n                                Hotline: \n                                    (+84) 24 38 696 165\n                                    \n                                Email: sme.hust.edu.vn\n                                Website: https://sme.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "TROY-BA", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": 40}, "2021": {"Talent recruitment": null, "Admissions targets": 80}, "2022": {"Talent recruitment": null, "Admissions targets": 60}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}}, "Description_1": "\n                                \n                                    Graduated: Bachelor\n                                    Admissions Time: April - August every year\n                                    Training time: 3.5 years (10 semesters)\n                                    Tuition: 80 million VND/year\n                                \n                                 \n\n\n\n\n\n \nTRAINING COOPERATION PROGRAM WITH\nUNIVERSITY OF TROY – UNITED STATES\nTroy University (TROY)\n \n\n\n\n\n\nSpecialization in training: Business Administration and Computer Science\n1. INTRODUCTION TO TROY UNIVERSITY, USA\n            Address: Troy University, 600 University Ave, Troy, AL 36082, United States\n            Phone: (800) 551-9716\n            Website: http://www.troy.edu/\n Troy University Rank:  https://www.usnews.com/best-college/troy-university-1047/overall-rankings\nFounded in 1887, Troy University (TROY) is a public university in the state of Alabama, USA. TROY is accredited by the Commision on Colleges of the Southern Association of Colleges and Schools (SACS) for its teaching quality. Troy University was rated by The Princeton Review as the best training university in the southwestern United States in 2009. In the  2010 Forbes Magazine survey and evaluation  , TROY Rated and ranked in the Top public schools in the United States and is the most prestigious university in the state of Alabama, USA. TROY is also rated by Money Magazine as one of the 25 most affordable public universities in the United States with the most reasonable tuition fees and ancillary costs.\n\nToday TROY trains more than 70 majors with over 20,000 students. TROY's training program is taught in 10 countries and more than 60 campuses worldwide. TROY's Bachelor of Business Administration and Master of Business Administration program are certified by ACBSP (The Association of Collegiate Business Schools and Programs) for training quality.\n\n“Troy university is accredited by the Southern Association of Colleges and schools Commission on Colleges to award associate, baccalaureate, master's, education specialist and doctoral degrees. Contact the Commission on Colleges at 1866 Southern Lane, Decatur, Georgia 30033-4097 or call 404-679-4500 for questions about the accreditation of Troy University ”( Troy University is accepted by the Association of Regional Colleges and Universities South and the Commission on Colleges of Associations, Bachelors, Masters, Education Specialists and Ph.D. Contact the Commission on Colleges at: 1866 Southern Street, Decatur, Georgie 20022 -4097 or contact 404-679-4500 with any questions about Troy University's accreditation principles).\n\nHIGHLIGHTS\nWhy should you study the Troy program?\n- The training program is accredited by a reputable US organization, ensuring modernity and always up to date.\n- High quality US and Vietnamese lecturers (3 foreign lecturers / period)\n- Serious, dynamic and creative learning environment\n- Good English skills\n- Abundant soft skills, ability to work in groups, research, and present well\n- The cost of studying is very reasonable\n- Convenient student transfer to the US with relatively cheap tuition fees\n- Very good job opportunity.\nFORM OF RECRUITMENT\n\nDirect admission (Talent screening)\nAdmission is based on high school graduation exam results\nAdmission is based on thinking test results\n\n                            ", "Description_2": "\n                            Training Program\n                            METHODS OF TRAINING AND GRADUATION\nAdmission requirements:  Admission to candidates with the overall high school average score of over 6.0 and high school graduation score according to the regulations of the Ministry of Education and Training of Vietnam. Candidates who have passed the exam have a TOEFL iBT 61 or IELTS 5.5 certificate to study professionally in English. Other candidates must attend an intensive English language course before entering a specialist program.\n\nSample Bachelor Degree from TROY University (USA)\n Training methods and qualifications\nStudents must complete a minimum of 120 credits (about 40 modules) under the TROY program to receive a university diploma: Bachelor's degree by TROY in the United States. All TROY students around the world receive the same diploma.\nStudents can study full-time at Hanoi University of Technology or accumulate credits to transfer to study at TROY or other universities in the United States.\nEDUCATION PROGRAM\nLanguage of training : English. Particularly, the social science modules are taught in Vietnamese by the Vietnamese Ministry of Education and Training's regulations.\nIntroduction about the program - SEE HERE\nDetailed training program framework - SEE HERE \nOr the most updated at troy.edu 's website - SEE DETAILS\nLecturers:  participating in teaching the program are lecturers appointed by Troy University.\nCONTACT COORDINATOR\n\nFull name: Assoc. Ngo Chi Trung\nCurrent position: Head of Legal Inspection Department, Hanoi University of Technology\nPhone: 091 338 2255\nHas participated in international cooperation management for over 15 years.\n                        \n                            Tuition - Scholarships\n                            TRANSITION CONDITIONS\nCompletion of at least 36 credits (equivalent to 03 terms of year 1),\nMinimum IELTS 5.5 or TOEFL iBT 61,\nAchieve a minimum grade point average (GPA) 2.5 (scale 4) or above.\nTRAINING FUNDS: About 26.7 million VND / period (1 year and 3 terms; converted by year 80 million / year)\n                        \n                            Careers\n                            If you have any questions about job opportunities, you can ask the coordinator or contact the Institute/School in charge.\n                        ", "Management": "\n                            Management Unit\n                            Viện Kinh tế và Quản lý\n                            \n                                Address: P302-304 Nhà C9, Đại học Bách Khoa Hà Nội; Số 1 Đại Cồ Việt, Q. Hai Bà Trưng, Tp. Hà Nội\n                                Hotline: \n                                    024 38 692 304 / 3868.0791 / 0398 698 689\n                                    \n                                Email: sem@hust.edu.vn\n                                Website: https://sem.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Việt", "Admission code": "ET-E9", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": "", "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                Currently, along with the trend of shifting to the digital economy, the Japanese human resource market in particular and the world has a huge demand for high-quality human resources in the field of embedded system programming and IoT. . The Intelligent Embedded Systems and IoT training program is designed to meet the above demand. After graduating, the Bachelor / Master will be oriented to work in Japan, the world or research and development companies in Vietnam.\nAdmission form\n\nTalent screening\nAdmission is based on high school graduation exam results\nCombined admission\n\n                            ", "Description_2": "\n                            Training Program\n                            (Download the program cirriculum HERE)\nTransitional conditions\n\nQualified or better\nAchieve Japanese N3.\n\nTraining mode\n\n4 years (bachelor program) + 1.5 years (master program)\nAfter a bachelor's degree, you can do graduate study for 1 year in Vietnam and 1 year in Japan.\nIntensive Japanese study for 7 semesters\n\nAdmission brochures \nProgram's Facebook:  facebook.com/Embedded_iot-284548442469378/\nAll details and questions can be accessed from the  fan page of the program  or email address:  minh.nguyenduc1@hust.edu.vn\n\n                        \n                            Tuition - Scholarships\n                            \nStudent exchange scholarships at Japanese universities.\nInternship scholarships in Japanese companies\n\n                        \n                            Careers\n                            \nHardware research and development engineer, embedded systems, IoT systems\nEngineer operating electronic systems, industrial electronic systems.\nSolution consultant, sales of electronic and telecommunication products.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "EM-E13", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": 40}, "2021": {"Talent recruitment": null, "Admissions targets": 60}, "2022": {"Talent recruitment": null, "Admissions targets": 100}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}}, "Description_1": "\n                                \n                                    Graduated: Bachelor - Master - Doctorate (NCS)\n                                    Admissions Time: August every year\n                                    Training time: 4 - 6 - 9 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                In recent years, organizations and businesses have increasingly recognized the importance of data and information for making smart business decisions. This requires organizations and businesses to have human resources capable of analyzing and promoting the power of data in supporting decision-making and suggesting development directions for organizations and businesses. However, Vietnam as well as other countries in the region are currently lacking a team of good experts in this field. \nThe advanced Business Analysis program is designed with modern, international standards oriented towards the digital economy. The program focuses on providing knowledge and skills in applying information technology, data processing and analysis methods to improve business processes and improve the operational efficiency of organizations and businesses.\nLanguage of instruction: English\nHighlights of the program\n\nStudy in an environment that meets international standards, training mainly in English\nFocus on equipping technology and information \nStudents participate in research and work in interdisciplinary teams from their early years\nPractice solving practical problems of businesses right during the learning process\nStudy with foreign lecturers, exchange students and transfer to study at foreign partner schools\n\nAdmission form\n\nDirect admission (Talent admission)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of the Thinking Assessment Test\n\n                            ", "Description_2": "\n                            Training Program\n                            Detailed training program - DOWNLOAD PDF\nObjectives and output standards of Business Analysis program - DOWNLOAD PDF\nWith a flexible program framework, students majoring in Business Analysis will have many options during their studies to help them choose the path that meets their needs, with a training program of 97. foundation & foundation credit, and 17 elective course credits with the expertise of each activity in this field. In addition, students also have the opportunity to transfer to partner schools in the framework of cooperation with Hanoi University of Technology.\nKnowledge and skills gained after graduation \n\nStudy in an environment of international standards, training mainly in English.\nAttention is paid to being equipped with technology and informatics skills.\nStudents participate in research and work in interdisciplinary groups from their early years.\nPractice solving practical problems of businesses right in the learning process.\nStudy with foreign faculty, exchange students and transfer studies at foreign partner schools.\n\nTraining mode \n\nStudents must have an entry language proficiency of IELTS 4.5 or equivalent.\nIn case candidates do not meet English requirements, Hanoi University of Science and Technology will organize intensive English learning immediately after admission.\nStudents studying this program can study for 4 years in the country and be granted a degree by the Hanoi University of Technology or can follow the 3 + 1 + 1 model (the first 3 years of study at Hanoi University of Technology and 2 next year to study abroad and receive a Master's degree in Business Analysis).\nWith the ability to fluently use foreign languages, technology and informatics skills, graduates of this program have many job opportunities at organizations, enterprises, and large corporations in the country and internationally.\n\n                        \n                            Tuition - Scholarships\n                            Contact\nINSTITUTE OF ECONOMICS AND MANAGEMENT\n\nAddress: Room 302 - 304, C9, Hanoi University of Science and Technology\nPhone: 024.3869.2304\nWebsite:  http://sem.hust.edu.vn\nAdmission hotline:  082 869 2304\n\n                        \n                            Careers\n                            The Importance of Business Analytics\nIn recent years, organizations and businesses have increasingly recognized the importance of data and information in making business smart decisions. This requires organizations and businesses need a human resource capable of analyzing and promoting the power of data in support of decision making, proposing development directions of organizations and enterprises. However, Vietnam as well as other countries in the region are in a shortage of skilled experts in this field.\nA look at the websites of Vietnamworks, CareerBuilder, Vietnam.recruite, and many other recruitment websites can see hundreds of lines of information about job vacancies in Business Analytics. According to McKinsey, in 2018, the United States was estimated to lack about 200,000 people with deep analytical skills, as well as 1.5 million business managers and analysts.\nAnswer the question \"Why is business analysis so much interested\"?\nThe growth of the digital world makes businesses face more and more new challenges. In recent years, businesses have accumulated more and more data. They can connect to a wealth of information from mobile devices, and all of this data can provide the ability to solve large process optimization problems and how to improve forecasting at scale. big.\nAnalyzing business practices allows managers to be more flexible in decision making, making their businesses adapt better and faster to changes in the business environment.\nIn addition, business analytics allows businesses to improve every aspect of their operations based on metrics coming from real activity flows. The faster businesses can capture the value gained from business analytics, they will easily surpass the market leaders in terms of performance, efficiency in management, investment decisions, as well as market access. fast and sustainable.\nVirtually any start-up has a digital approach to the marketplace. Many small and midsize companies are also looking for inbuilt business analytics solutions that they can simply access and use to improve their own business efficiency. This is also the reason why more and more universities around the world are expanding their training programs for analysts.\nJob opportunities\nWith the ability to fluently use foreign languages, have good technology and informatics skills to meet job requirements in the context of the industrial revolution 4.0, graduates of this program have many job opportunities. at organizations, enterprises, and large corporations in the country and internationally.\n                        ", "Management": "\n                            Management Unit\n                            Viện Kinh tế và Quản lý\n                            \n                                Address: P302-304 Nhà C9, Đại học Bách Khoa Hà Nội; Số 1 Đại Cồ Việt, Q. Hai Bà Trưng, Tp. Hà Nội\n                                Hotline: \n                                    024 38 692 304 / 3868.0791 / 0398 698 689\n                                    \n                                Email: sem@hust.edu.vn\n                                Website: https://sem.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "TROY-IT", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": 40}, "2021": {"Talent recruitment": null, "Admissions targets": 80}, "2022": {"Talent recruitment": null, "Admissions targets": 80}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}}, "Description_1": "\n                                \n                                    Graduated: Bachelor\n                                    Admissions Time: April - August every year\n                                    Training time: 3.5 years (10 semesters)\n                                    Tuition: 80 million VND/year\n                                \n                                 \n\n\n\n\n\nTRAINING COOPERATION PROGRAM WITH\nUNIVERSITY OF TROY – UNITED STATES\nTroy University (TROY)\n\n\n\n\n\nSpecialization in training: Business Administration and Computer Science\n1. INTRODUCTION TO TROY UNIVERSITY, USA\n            Address: Troy University, 600 University Ave, Troy, AL 36082, United States\n            Phone: (800) 551-9716\n            Website: http://www.troy.edu/\nTroy University Rank:  https://www.usnews.com/best-college/troy-university-1047/overall-rankings\nFounded in 1887, Troy University (TROY) is a public university in the state of Alabama, USA. TROY is accredited by the Commision on Colleges of the Southern Association of Colleges and Schools (SACS) for its teaching quality. Troy University was rated by The Princeton Review as the best training university in the southwestern United States in 2009. In the  2010 Forbes Magazine survey and evaluation  , TROY Rated and ranked in the Top public schools in the United States and is the most prestigious university in the state of Alabama, USA. TROY is also rated by Money Magazine as one of the 25 most affordable public universities in the United States with the most reasonable tuition fees and ancillary costs.\n\nToday TROY trains more than 70 majors with over 20,000 students. TROY's training program is taught in 10 countries and more than 60 campuses worldwide. TROY's Bachelor of Business Administration and Master of Business Administration program are certified by ACBSP (The Association of Collegiate Business Schools and Programs) for training quality.\n\n“Troy university is accredited by the Southern Association of Colleges and schools Commission on Colleges to award associate, baccalaureate, master's, education specialist and doctoral degrees. Contact the Commission on Colleges at 1866 Southern Lane, Decatur, Georgia 30033-4097 or call 404-679-4500 for questions about the accreditation of Troy University ”( Troy University is accepted by the Association of Regional Colleges and Universities South and the Commission on Colleges of Associations, Bachelors, Masters, Education Specialists and Ph.D. Contact the Commission on Colleges at: 1866 Southern Street, Decatur, Georgie 20022 -4097 or contact 404-679-4500 with any questions about Troy University's accreditation principles).\n\nHIGHLIGHTS\nWhy should you study the Troy program?\n- The training program is accredited by a reputable US organization, ensuring modernity and always up to date.\n- High quality US and Vietnamese lecturers (3 foreign lecturers / period)\n- Serious, dynamic and creative learning environment\n- Good English skills\n- Abundant soft skills, ability to work in groups, research, and present well\n- The cost of studying is very reasonable\n- Convenient student transfer to the US with relatively cheap tuition fees\n- Very good job opportunity.\nFORM OF RECRUITMENT\n\nDirect Admission\nAdmission based on the results of the High School Graduation Exam\nAdmission based on the results of the Thinking Skills Assessment \n\n                            ", "Description_2": "\n                            Training Program\n                            METHODS OF TRAINING AND GRADUATION\nAdmission requirements:  Admission to candidates with the overall high school average score of over 6.0 and high school graduation score according to the regulations of the Ministry of Education and Training of Vietnam. Candidates who have passed the exam have a TOEFL iBT 61 or IELTS 5.5 certificate to study professionally in English. Other candidates must attend an intensive English language course before entering a specialist program.\n\nSample Bachelor Degree from TROY University (USA)\nTraining methods and qualifications\nStudents must complete a minimum of 120 credits (about 40 modules) under the TROY program to receive a university diploma: Bachelor's degree by TROY in the United States. All TROY students around the world receive the same diploma.\nStudents can study full-time at Hanoi University of Technology or accumulate credits to transfer to study at TROY or other universities in the United States.\nEDUCATION PROGRAM\nLanguage of training : English. Particularly, the social science modules are taught in Vietnamese by the Vietnamese Ministry of Education and Training's regulations.\nIntroduction about the program - SEE HERE\nDetailed training program framework - SEE HERE\nOr the most updated at troy.edu 's website - SEE DETAILS\nLecturers:  participating in teaching the program are lecturers appointed by Troy University.\nCONTACT COORDINATOR\n\nFull name: Assoc. Ngo Chi Trung\nCurrent position: Head of Legal Inspection Department, Hanoi University of Technology\nPhone: 091 338 2255\nHas participated in international cooperation management for over 15 years.\n                        \n                            Tuition - Scholarships\n                            TRANSITION CONDITIONS\nCompletion of at least 36 credits (equivalent to 03 terms of year 1),\nMinimum IELTS 5.5 or TOEFL iBT 61,\nAchieve a minimum grade point average (GPA) 2.5 (scale 4) or above.\nTRAINING FUNDS: About 26.7 million VND / period (1 year and 3 terms; converted by year 80 million / year)\n                        \n                            Careers\n                            If you have any questions about job opportunities, you can ask the coordinator or contact the Institute/School in charge.\n                        ", "Management": "\n                            Management Unit\n                            Khoa Toán - Tin\n                            \n                                Address: Phòng 106 nhà D3, ĐHBK Hà Nội, Số 01 Đại Cồ Việt - Quận Hai Bà Trưng - Hà Nội\n                                Hotline: \n                                    024 3869 2137\n                                     & 024 3868 2470\n                                Email: sami@hust.edu.vn\n                                Website: http://sami.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "EM-E14", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": 50}, "2021": {"Talent recruitment": null, "Admissions targets": 80}, "2022": {"Talent recruitment": null, "Admissions targets": 135}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}}, "Description_1": "\n                                \n                                    Graduated: Bachelor of Hanoi University of Science and Technology\n                                    Admissions Time: August every year\n                                    Training time: 4 years (at Hanoi University of Science and Technology)\n                                    Tuition: 50 - 60 million VND/year\n                                \n                                 \n\nINDUSTRY: LOGISTICS ADVANCED PROGRAMS AND SUPPLY CHAIN ​​MANAGEMENT\nAs a long-standing training major in many countries, top managers such as Tim Cook (CEO Apple), Mike Duke (CEO Walmart), Edward Earl Whitacre Jr. (former General Motors president and CEO),… studied Industrial Management. The knowledge and training content of this specialization is widely applied in manufacturing and service enterprises. This specialization is highly appreciated by employers. Is the industry currently in need of large labor recruitment, especially foreign manufacturing enterprises\nSpecialized introduction\nThe training program of Logistics and Supply Chain Management is designed according to international standards, built on the basis of reference and refined from advanced programs in the world. Specialized subjects students study career-oriented, with local and international faculty, and with experts from business. In addition to providing knowledge, students can practice early in the enterprise to increase their career skills, software skills, and foreign language skills to meet the high quality demand of the Logistics industry.\nLanguage of training: English\nIntroduction about the program - SEE HERE\nIntroduction video about the program EM-E14\nAdmission form\n\nDirect admission (Talent admission)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of the Thinking Assessment Test\n\n\n                            ", "Description_2": "\n                            Training Program\n                            Training Program Information - SEE HERE\n\nSemester 1 to 4: study basic science, political theory, physical education, security and defense.\nSemester 3 to 7: study specialized subjects: Logistics Management, Production Planning and Dispatching, Application Statistics and Sampling Design, Project Management, Optimal Modeling, Production System Design Production, Production and Service System Simulation, Supply Chain Management, Lean Manufacturing, Business Simulation Game ...\nSemester 5 to 8: specialized internship (3 consecutive internships, and graduation thesis)\n\nAdvantages\nLearning entirely in English with specialized subjects, so the foreign language skills are quickly improved; Combined learning with practice in businesses right in the learning process; Advanced training methods focus on both knowledge, and soft skills; Training programs according to international standards: training in English, similar programs with programs of foreign schools; Experienced Vietnamese lecturers are trained abroad and foreign lecturers come from countries such as Japan, USA, Germany, Thailand, Singapore…; Many internships in enterprises; Study with business leaders. Some partner enterprises: Toyota Vietnam; Legroup; Canon Vietnam; HB Group; Hanesbrand; Garment Bac Giang; EMTC; Thang Long Metal ...; Opportunities for transfer or postgraduate study at foreign schools are easy.\nOutcome Objective:  Students are equipped\nSpecialized knowledge in Industrial Systems Management Practical applicability to Industrial Systems Management Professional soft skills such as communication, team work, using computers and software to support later work Ability to communicate well, unique ability and write documents in English to work in an international environment\nTraining mode\nStudents enrolled in this training program can study for 4 years domestically and receive a bachelor's degree, five years domestically and a Master's degree by Hanoi University of Technology. Or you can study on a 3 + 1 + 1 model (the first 3 years of study at Hanoi University of Technology and the next 2 years to study abroad and receive a Master's degree in specialized management - Logistics and supply chain management)\n                        \n                            Tuition - Scholarships\n                            Training cost: About 50 - 60 million VND/year\n                        \n                            Careers\n                            \nOpportunities to work in an international environment, multinational corporations, FDI enterprises, domestic and foreign production units;\nJob opportunities in service businesses;\nEmployment opportunities at state management agencies and relevant units in the field of Industrial System Management.\nEasy to continue advanced study, graduate program at foreign schools.\n\n\nIEM Program Coordinator TS. Nguyen Thi Xuan Hoa (Tuesday from left) with students in the first course of Industrial Management of the International Training Institute for an internship at Hanoi Brewery in June 2016.\nTypical recruitment businesses\nDomestic and foreign companies, enterprises, and corporations in the fields of Logistics, transportation, and supply chain management such as Samsung, Unilever Vietnam, Bosh, Jabil Vietnam, Nestle, BigC, Vinamilk, Vietnam Airline, VietJet, ...\nWorking position\nWorking at enterprises, international corporations in the field of Logistics, the field of logistics coordination for retail corporations. Working in manufacturing enterprises at home and abroad on production management and supply chain management. Opportunity to work at the agency in policy making, research on Logistics and supply chain.\n                        ", "Management": "\n                            Management Unit\n                            Viện Kinh tế và Quản lý\n                            \n                                Address: P302-304 Nhà C9, Đại học Bách Khoa Hà Nội; Số 1 Đại Cồ Việt, Q. Hai Bà Trưng, Tp. Hà Nội\n                                Hotline: \n                                    024 38 692 304 / 3868.0791 / 0398 698 689\n                                    \n                                Email: sem@hust.edu.vn\n                                Website: https://sem.hust.edu.vn\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "TE-E2", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 80}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 4 – 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                Automotive engineering (Advanced Program) is designed to provide high-quality human resources for the automotive market, especially cars with new sources of motivation (electric, hybrid electric - internal combustion engines, fuel cells. ) and regional and international smart cars. Meet the human resources needs of many major car manufacturers in the world that are investing in developing future generations of cars, including electric cars, hybrid cars or fuel cell cars. and smart car.\nAutomotive engineering (Advanced Program) trains automotive engineers to have the ability to create technologies to design, manufacture, and manufacture new-generation cars, have a foreign language proficiency and have the ability to work in corporations, joint ventures, major automobile factories in the world (global automotive engineer); capable of operating a modern car production line, capable of exploiting and using a new generation of cars with control, automation and intelligent technology; as well as the ability to continue studying at a higher level is constantly being improved.\nAdmission form\n\nTalent screening\nAdmission is based on high school graduation exam results\nCombined admission\n\nAutomotive Engineering has always been highly appreciated in the world and in Vietnam due to its widespread applicability in all industries and services. The rapid growth rate of road motor vehicles, especially for cars in Vietnam, is strongly boosting the automobile and supporting industries. The need for automotive engineers capable of working in major corporations, joint ventures, and automobile factories in the world (global automotive engineers) is constantly increasing. The Department of Automotive Engineering of the Institute of Dynamic Engineering has been built and developed since 1960, with the high quality of training proven by generations of students. An automotive engineering engineer graduated from Hanoi University of Technology with deep technical knowledge and expertise, has the ability to research and create technologies to design, manufacture, manufacture cars, and manage vehicles.\n                            ", "Description_2": "\n                            Training Program\n                            Detailed training program    DOWNLOAD PDF\nThe Advanced Automotive Engineering Programme aims to provide high quality human resources for the international and regional automotive market, especially automobiles powered with new sources (electricity, hybrid electricity-internal combustion engine, fuel cells) and smart automotive. It is expected that the programme can meet the human resource needs in big automobile manufacturers in the world which are investing in developing future automobile generations including those powered by electricity, electricity-internal combustion engine hybrid, fuel cells and smart automobiles.\nKnowledge and skills gained after graduation\n\nKnowledge\n\nStudents are equipped with solid technical foundations and specialized knowledge, have practical professional skills, have the ability to design and manufacture in the field of manufacturing automobiles, dynamics, and specialized vehicles. use.\n\nSkill\n\nStudents have professional and personal skills, the ability to study at a higher level, the ability to self-study to adapt to the continuous development of science and technology, and the ability to learn for a lifetime. Have professional practice skills, and have the ability to formulate, design and operate new products and systems.\n\nForeign Language\n\nUse English effectively in communication and work, achieving a TOEIC score of 500 or higher. Have a language proficiency good enough to work in an interdisciplinary, multicultural, and multinational environment.\nTraining time and ability to study to higher education\n\nTraining Bachelor: 4 years\nIntegrated training Bachelor - Engineer: 5 years\nIntegrated training Bachelor - Master: 5.5 years\nTraining Bachelor - Master - Doctor: 8.5 years \n\n                        \n                            Tuition - Scholarships\n                            Available scholarship opportunities include:\n\nScholarships from Hanoi University of Science and Technology;\n05 scholarship from School of Transportation Engineering;\n03 student internship scholarships in abroad;\n20-30 training scholarships to work and study Japanese companies and universities.\n\n                        \n                            Careers\n                            \nResearch and Development Engineers to work in dedicated research teams in Hanoi University of Science and Technology and foreign partner universities in Japan, Korea and Germany;\nDesign, Operation and Manufacturing Engineers to work in factories, research and development centers in big automobile manufacturing groups which are engaged in developing new automobile generations, such as Tesla motors, Volkswagen, Toyota, Nissan, Peugeot, Renault, Vinfast, Truong Hai.\nEngineers to work in automobile groups in Japan and Korea; researchers to work in universities, research institutes and technology transfer centers in the field of automotive engineering.\nEngineers to work in automobile registration stations, businesses in new automobiles generations, state management agencies in ground vehicles.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Cơ khí\n                            \n                                Address: VP C7-614M, ĐH Bách khoa Hà Nội, số 1 Đại Cồ Việt, Hà Nội\n                                Hotline: \n                                    (+84) 24 38 696 165\n                                    \n                                Email: sme.hust.edu.vn\n                                Website: https://sme.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "MS-E3", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 50}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 50}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Integrated Masters – PhD (NCS)\n                                    Admissions Time: 4 – 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                \nAdvanced Program in Materials Science and Engineering is one of the first ten training programs for engineers in English in Vietnam, starting with enrollment in 2006. Training content using the University's program University of Illinois (USA), ranked 41st in the world according to 2017 statistics.\nQualified engineers meet both domestic practical requirements and international standards. Methods of learning and experiment are conducted according to the method of group work, developing creativity of learners. The program has passed international accreditation by the AUN-QA function.\nThe program provides learners with an understanding of a material's structure and the fabrication-structure-properties relationship. Learners will learn about modern science and technology, including heat transfer, metabolic and chemical kinetics, thermodynamics, kinetics, and some aspects of mechanics, physics, solid chemistry, etc. .. They were also imparted with in-depth knowledge about the economic, social and environmental aspects of the fabrication of materials. Graduate students have the ability to operate, develop and research in rapidly growing industries such as electronics, aerospace, medicine, and in the manufacturing and manufacturing industries. other basis materials.\nLanguage of instruction: English\nAdmission form\n\nDirect admission (Talent screening)\nAdmission is based on high school graduation exam results\nAdmission is based on thinking test results\n\n                            ", "Description_2": "\n                            Training Program\n                            Introduction about the program - SEE HERE\nDetailed training program - DOWNLOAD HERE\n\nDetailed outline see  HERE\nSelf-assessment report for AUN-QA test see  HERE\n\nTraining time: 5 years\nVolume of full-course knowledge: 158 credits\nTraining process, graduation conditions\nStudents learn in the best conditions of study in English .  The curriculum is built on the basis of the training program in Materials Science and Engineering of the  University of Illinois at Urbana Champaign   (UIUC,  http://www.uiuc.edu/ ), a school US training in Materials Science and Engineering. Lecturers are professors of Hanoi University of Science and Technology and some schools and research institutes have experience in teaching, teaching and learning in English-speaking countries; Some subjects are taught directly by UIUC professors.\nThe training process is organized according to the credit institution, in accordance with the training regulations for regular universities and colleges according to the credit institution of Hanoi University of Technology. The first year students study according to a standard study plan, mainly social sciences and humanities (in Vietnamese), additional English and some advanced Maths. From the second year onwards learn entirely in English.\nKnowledge and skills gained after graduation \nKnowledge \n\nGraduates of the Advanced Materials Science and Engineering Program have a firm grasp of the general technical foundations and in-depth expertise in metallic materials, electronic and nanomaterials, and polymer materials that adapt to all working environments. job.\n\nSkill \n\nAbility to apply basic, core and specialized knowledge in using and manufacturing materials effectively for enterprises, developing materials in domestic universities and research institutes. and internationally;\nAbility to plan research (independently and in groups), organize work and communicate effectively; Ability to develop in-depth orientation of scientific research ideas;\nAbility to work in groups, develop team leadership skills.\n\nForeign Language \n\nEffective use of English language in communication and work, achieving TOEIC score of 650 or above\n\nTraining time and ability to study to higher education \n\nEngineer Training: 5 years\nIntegrated Training Engineer - Master: 6 years\n\n                        \n                            Tuition - Scholarships\n                            Scholarships, financial assistance\nIn addition to the University's scholarships and financial support, annually students of the Advanced Materials Science and Engineering Program can receive:\n\nMany scholarships for outstanding students and annual academic support. The total value is up to hundreds of millions of dong.\n\nStudent exchange scholarships, graduate study\n\nStudents have many internships and short-term exchanges at foreign universities.\n\n                        \n                            Careers\n                            \n100% of students have jobs after 1 year of graduation, of which, more than 30% of graduate students have received scholarships abroad to study in countries such as the US, Japan, Australia, Korea, Canada.\nPopular salary is 10-12 million / month.\n\nTypical job position:\n\nEngineers to design, research and operate in domestic and foreign companies and industrial groups in the fields of materials science and engineering, electrical energy, electrical equipment, and automation;\nLecturers and scientists at universities and research institutes related to materials.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Vật liệu\n                            \n                                Address: Tầng 7 - nhà D8, Số 1 Đại Cồ Việt, Q.Hai Bà Trưng, Hà Nội\n                                Hotline: \n                                    086 548 5665\n                                    \n                                Email: smse@hust.edu.vn\n                                Website: https://smse.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "ME-E1", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 4 – 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                Mechatronic Engineering's advanced program is built on the basis of the Mechatronic Engineering training program development of Chico University (USA) in combination with the reference training program of Sibaura University (Japan ) and National Taiwan University (NTU). \nStudents studying this discipline will be equipped with solid background and specialized knowledge, have professional and research skills, and the ability to work and to be creative in all working environments to solve problems. topics related to the design and manufacture of equipment, mechatronic systems and industrial production systems operation, quickly adapting to the working environment of the industrial revolution 4.0.\nLanguage of instruction: English\nAdmission form\n\nTalent screening\nAdmission is based on high school graduation exam results\nCombined admission\n\nApply knowledge of math, science, and mechatronics engineering to formulate and solve the problems. Conduct experiments, and analyze and interpret the resultant data, design components and mechatronics systems which integrate computers, sensors, and actuators in mechanical system to meet design needs, and design experiments to evaluate system performance with respect to specifications.\nMechatronics is the study of design  of intelligent system and products in which mechanization and control requiring sensing, actuation are combined and controlled by computer to archieve improved product quality and performance.\nThis program have met the requirements of AUN-QA since 2017\n\nUndergradute:                         4 years\nUndergradute-Engineer:        5 years\nUndergradute-Master:           5.5 years\nUndergradute-Master-PhD:  8.5 years\n\n                            ", "Description_2": "\n                            Training Program\n                            (Download the program cirriculum HERE)\nKnowledge and skills gained after graduation\nKnowledge\n\nHaving broad and solid expertise, well-adapted to industry-relevant jobs, focusing on the applicability of mechatronic and mechatronic core and basic knowledge combined with the ability to use modern tools to research, design, manufacture, build and operate mechatronic systems / processes / products.\n\nSkill\n\nDesigning, manufacturing, assembling, operating and maintaining mechatronic equipment, systems, production lines such as robots, aircraft, cars ... or industrial machinery systems. .\nSkills to work effectively in multidisciplinary teams and in an international setting.\nCan participate in the implementation and testing of mechatronic engineering systems / processes / products / solutions and the ability to operate / use / exploit systems / products / technical solutions in the field. mechatronic field.\n\nForeign Language\n\nEffective use of English language in communication and work, achieving TOEIC from 650 points or more.\n\nTraining time and ability to study to higher education\n\nTraining Bachelor: 4 years\nIntegrated training Bachelor - Engineer: 5 years\nIntegrated training Bachelor - Master: 5.5 years\nIntegrated training Bachelor - Master - Doctor: 8.5 years\n\n                        \n                            Tuition - Scholarships\n                            There are many opportunities to receive scholarships to study and research graduate at domestic and foreign universities. In addition to scholarships and financial support from Hanoi University of Technology, students majoring in Mechanical Engineering have the opportunity to receive:\n\n40 - 48 study support scholarships with a total value of over 240,000,000 VND / year.\n\n                        \n                            Careers\n                            \nOver 98% of students have jobs after 1 year of graduation with the common salary of 10-15 million / month.\nTypical job positions:\n\n- Researching, designing, manufacturing, managing production, operating at factories of domestic and international enterprises and corporations related to mechatronic and mechanical fields.- Become a lecturer, researcher at universities, research institutes;- There are many opportunities to receive scholarships for study, postgraduate research at domestic and foreign universities\n                        ", "Management": "\n                            Management Unit\n                            Trường Cơ khí\n                            \n                                Address: VP C7-614M, ĐH Bách khoa Hà Nội, số 1 Đại Cồ Việt, Hà Nội\n                                Hotline: \n                                    (+84) 24 38 696 165\n                                    \n                                Email: sme.hust.edu.vn\n                                Website: https://sme.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "IT-E7", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}}, "Description_1": "\n                                \n                                    Graduated: 4 – 8 months annually\n                                    Admissions Time: Bachelor - Master Integrated\n                                    Training time: 40 - 45 million VND/year\n                                    Tuition: 4 - 5.5 years\n                                \n                                Goals\n\nGlobal Engineering Program in Information and Communication Technology (Global ICT) was started off in 2009. The aim of this educational program is to train global engineers that are good at not only Information and Communication Technology but also English - an international language. These engineers will play the bridging role in connecting the Vietnamese ICT market and the international ICT market all over the world.\n\nCurricula\n\n5 years standard educational duration with 166 credits in total.\nGlobal ICT program provides intensive English training in the first academic year in order to improve English skills of students including listening, speaking, reading, writing and integrated skills.\nAll specialized courses are given in English with the curricula meeting international standards, where the practical time in the laboratory is equivalent to the theoretical time in the classroom. \nThe program provides fundamental courses in Information and Communication Technology such as Programming Language, Software Technology, Computer Network, Database and Computer Architecture.\nThe program provides advanced courses in designing and developing Smart Software, Internet Applications, Embedded Systems and Network System Administrations.\nAll students are sent to industry to do an internship at the third academic year. \nAll students do continuous researches under the supervision of faculty members from the fourth academic year.\n\nInternational learning environments\n\nThe program receives frequently exchange and full-time students from Japan (2), Australia (1), Germany (2), Spain (1), Indonesia (1), Korea (1). \nThe program receives from times to times international professors for giving courses. For example professors from The University of Iowa (America), Uppsala University (Sweden), Korea Advanced Institute of Science and Technology (Korea), Shibaura Institute of Technology (Japan), University of Turku (Finland) and many other universities all over the world ...\n\nExchange and scholarship opportunities - \"Global ICT goes everywhere\"\nCooperating activities of Global ICT Program\n\n\nThere are many one-semester exchange opportunites with the universities in German, Sweden, Japan and Canada each year. More information about annual exchange programs\n\n\nA lot of Global ICT students have attended EBA Fieldwork in Japan and other Asian countries with sponsored expense. \n\n\nA report from a group of Global ICT EBA participants\n\n\nHanoi University of Science and Technology cooperates with University of Aizu (Japan) in the \"3 + 2 Program\", in which students will enroll in the University of Aizu Bachelor's program after studying at HUST for three years.\n\n\nThe first cohort of students attending \"3 + 2 Program\"\n\n\nHanoi University of Science and Technology cooperates with Uppsala University (Sweden) in the \"3 + 1 Program since 2018\"\n\n\nNews on 3 + 1 Program with Uppsala University\n\n\nhttp://htqt.hust.edu.vn/en/news-event/662--hop-tac-dao-tao-31-chuong-trinh-global-ict-giua-truong-dhbk-ha-noi-va-dh-uppsala-thuy-dien.html\n\n\nGlobal ICT students have chances of continuing Master’s and Doctor’s program in developed countries such as Finland, Japan, German, Australia, America and so on without taking English tests.\n\n\n                            ", "Description_2": "\n                            Training Program\n                            (Download the program cirriculum HERE)\nAdmission for international exchange students \nGlobal ICT program welcomes all international students. International students can apply for fulltime study or one semester exchange in Global ICT program. From 2015 Global ICT program have received 1 fulltime student from Korea and 7 exchange students from Spain, Japan, Germany, Australia and Indonesia. \nApplication \nInterested students should send following documents to the address: linhtd@soict.hust.edu.vn\n\nCV with contact information \nLetter of purpose \nTranscript of university academic records\nList of courses that student wishes to take. \nInternational English test results: TOEFL or TOEIC or IELTS \n\nImportant dates \n\n\n\n\n \n\n\nSemester 1 (Autumn)\n\n\nSemester 2 (Spring)\n\n\nNote\n\n\n\n\nApplication Deadline\n\n\nMay 30th\n\n\nOct 30th\n\n\n2.5 month before the starting of the Semester\n\n\n\n\nAcceptance Notification\n\n\nJune\n\n\nNovember\n\n\n2 weeks after reception of application\n\n\n\n\nExpected Arrival Date\n\n\nMiddle of August\n\n\nMiddle of January\n\n\nBegining of the semester\n\n\n\n\nOrientation\n\n\nAugust\n\n\nMiddle of January\n\n\nBegining of the semester\n\n\n\n\nSemester Period \n\n\nAugust -January next year\n\n\nJanuary –June \n\n\n \n\n\n\n\n                        \n                            Tuition - Scholarships\n                            Scholarships and financial aid\nIn addition to the scholarships and financial support of Hanoi University of Science and Technology, students enrolled in the Global ICT Program with good academic results have the opportunity to receive talented scholarships from the Alumni Association / Association Scholarship Fund. IT industry or from large corporations such as Microsoft, Samsung, Vingroup, VNPT ...\nIn addition, students with good teaching and research abilities can participate as teaching assistants (TA, supporting teachers), or research assistants (Research Assistant - RA, support and Do research with the teachers at the system of the Institute's laboratories) with a remuneration that can be up to 4 million / month, together with the Institute's official certificate so that students will have favorable conditions to apply for scholarship. Currently, the Institute is the only unit implementing these programs in the University.\nIntegrated bachelor's - master's degree: students have the opportunity to receive tuition-free scholarships from the University, scholarships to support postgraduate training of domestic and foreign corporations and corporations.\nStudent exchange scholarships and internship opportunities\nAs part of the Elitech Programs, Global ICT Program regularly invites lecturers who are professors and international experts to teach students. In addition, the Institute cooperates with prestigious universities in Europe, North America and Japan, giving students the opportunity to exchange and early exposure to an international working environment, such as University of Applied Sciences. Application of Regensburg (OTH, Germany), Nanyang Technical University (Singapore), National University of Singapore, Uppsala University (Sweden), Aizu University (Japan), Tokyo University of Technology (Japan) ...\nThe program also regularly receives international students to exchange from Japan, Australia, Germany, Spain, Korea, Indonesia, Myanmar ...\nDuring the process, students can practice experiences in the practical working environment at more than 200 partner companies of the Institute, including many international enterprises based in Vietnam.\nIn addition, the Institute Alumni Network in Silicon Valley also regularly organizes support and advisory activities to help students have the opportunity to exchange and intern at leading technology corporations in the world.\n                        \n                            Careers\n                            100% of students have jobs after 1 year of graduation.\n\nWorking in large corporations of Japan, America, Europe, in international projects.\nOutstanding students have the ability to work in Silicon Valley, USA, through the support of the ICT Institute alumni network in the US.\nBeing the core engineer for large companies in Vietnam looking to foreign markets.\nHaving an advantage thanks to professional skills and foreign language ability can work directly with foreign partners.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Công nghệ thông tin và Truyền thông\n                            \n                                Address: Văn phòng Trường CNTT&TT (P505 - Nhà B1)\n                                Hotline: \n                                    024 3869 2463\n                                    \n                                Email: vp@soict.hust.edu.vn\n                                Website: https://soict.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "IT-E10", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}}, "Description_1": "\n                                \n                                    Graduated: Bachelor - Master\n                                    Admissions Time: 4 – 8 months annually\n                                    Training time: 4 - 6 years\n                                    Tuition: 50 - 60 million VND/year\n                                \n                                Bachelor of Data Science and Artificial Intelligence (Advanced program): Specialized training in Data Science and Artificial Intelligence. Students will learn in English.\nTraining industry\nThe program aims to train highly qualified experts in data science and artificial intelligence (DS & AI scientist). The program is modernly designed, designed by leading experts in the field of DS & AI in Vietnam and in the world. With the orientation of training professionals, students participating in the program are fully equipped with academic knowledge, along with focusing on increasing practice time, as well as learning through experience in the system of rooms. research lab, as well as companies and groups operating in the field of ICT at home and abroad.\n\n\nFinal year students will be mentored by experts in the field of DS & AI at home and abroad, especially experts - alumni of the Institute of Information and Communication Technology working at multi-technology corporations. countries such as: Google, Facebook, Microsoft, Amazon ... to improve knowledge while adding additional international standards of working and research skills, targeting the global labor market, as well as fostering god of innovation and entrepreneurship.\nComputing infrastructure system for students' practice includes supercomputer systems, parallel computers with leading computing power in Vietnam and the region, as well as through cooperation with major corporations. such as Microsoft, IBM ... students can experience advanced computing technologies, platforms, and data processing.\nLanguage of instruction: English\nAdmission form\n\nDirect admission\nAdmission is based on high school graduation exam results\nAdmission is based on Thinking Skills Assessment results\n\n                            ", "Description_2": "\n                            Training Program\n                            For detailed training programs, please contact:  Institute of Information Technology and Communication\n\nAddress: Office of Institute of Information Technology (P504 - Building B1)\nHotline: 024 3869 2463 & 024 3869 2463\nEmail:  vp@soict.hust.edu.vn\nWebsite:  https://soict.hust.edu.vn/\n\nTraining knowledge\n\nThe program is designed according to international standards with time in the laboratory equivalent to theoretical study time.\nThe program includes basic knowledge with data science orientation such as: math, probability-statistics, artificial intelligence, machine learning, deep learning, data mining, big data processing / representation, blockchain, professional knowledge, as well as subjects related to innovation skills, and entrepreneurship ...\nStudents have an internship at an IT business from the 3rd year.\nStudents are doing research continuously with lecturers from the 2nd year.\nIn addition, students are trained:\n\nSkills: Presentation, organization, teamwork, leadership skills;\nForeign language: Use English effectively at work, score TOEIC 650 or higher.\n\n\n\nTraining time\n\nThe DS-AI program offers training in the model of Bachelor (4 years), Bachelor - Engineer (5.5 years), or Bachelor - Master (5.5 years);\nStudents have many opportunities to continue studying at graduate and doctoral levels in developed countries such as Finland, Japan, Germany, Australia, America ...\n\nAbility to study higher\n\nStudents can participate in 4 + 1 + 1 transfer programs with Uppsala University (Sweden), earning a Master of Data Science degree.\nStudents have many opportunities to continue studying at graduate and doctoral levels in developed countries such as Finland, Japan, Germany, Australia, America ...\n\nStandard output of training program\n\nThe program is designed according to international standards with time in the laboratory equivalent to theoretical study time.\nThe program includes basic knowledge with data science orientation such as: math, probability-statistics, artificial intelligence, machine learning, deep learning, data mining, big data processing / representation, blockchain, professional knowledge, as well as subjects related to innovation skills, and entrepreneurship ...\nStudents have an internship at an IT business from the 3rd year.\nStudents are doing research continuously with faculty since the 4th year.\nStudents after graduation must reach 650 TOEIC.\n\n \n                        \n                            Tuition - Scholarships\n                            Scholarships and financial aid\nIn addition to the scholarships and financial support of Hanoi University of Science and Technology, students enrolled in the DS-AI program with good academic results have the opportunity to receive talented scholarships from the Alumni Association / Association Scholarship Fund. IT enterprises or from large corporations such as Microsoft, Samsung, Vingroup, VNPT ...\nIn addition, students with good teaching and research abilities can participate as teaching assistants (TA, supporting teachers), or research assistants (Research Assistant - RA, support and Do research with the teachers at the system of the Institute's laboratories) with a remuneration that can be up to 4 million / month, together with the Institute's official certificate so that students will have favorable conditions to apply for scholarship. Currently, the Institute is the only unit implementing these programs in the University.\nIntegrated bachelor's - master's degree: students have the opportunity to receive tuition-free scholarships from the University, scholarships to support postgraduate training of domestic and foreign corporations and corporations.\nStudent exchange scholarships and internship opportunities\nAs part of the Elitech Programs, DS-AI Program regularly invites lecturers who are professors and international experts to teach students. In addition, the Institute cooperates with prestigious universities in Europe, North America and Japan, giving students the opportunity to exchange and early exposure to an international working environment, such as University of Applied Sciences. Application of Regensburg (OTH, Germany), Nanyang Technical University (Singapore), National University of Singapore, Uppsala University (Sweden), Aizu University (Japan), Tokyo University of Technology (Japan) ...\nThe program also regularly receives international students to exchange from Japan, Australia, Germany, Spain, Korea, Indonesia, Myanmar ...\nDuring the process, students can practice experiences in the practical working environment at more than 200 partner companies of the Institute, including many international enterprises based in Vietnam.\nIn addition, the Institute's Alumni Network in Silicon Valley also regularly organizes support and advisory activities to help students have the opportunity to exchange and intern at leading technology corporations in the world.\n                        \n                            Careers\n                            Due to the needs of Industry 4.0, in which the issue of \"smartization\" of traditional systems plays a vital role, so data science experts are the hottest profession in the world. with a salary outperforming other industries in the IT field. Graduates can work:\n\nIn data analytics, investigations, surveys and forecasts at organizations in almost every sector of the economy, in multinational corporations, banks, insurance companies, consulting firm ...\nIn the departments of artificial intelligence product development, big data processing / analysis / representation at domestic and foreign technology corporations ...\nStart a business, develop data analysis applications, and artificial intelligence for life.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Công nghệ thông tin và Truyền thông\n                            \n                                Address: Văn phòng Trường CNTT&TT (P505 - Nhà B1)\n                                Hotline: \n                                    024 3869 2463\n                                    \n                                Email: vp@soict.hust.edu.vn\n                                Website: https://soict.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "ET-E5", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \nBiomedical Engineering (Advanced Program) \nis based on the original program of the University of Wisconsin-Madison, Wisconsin (USA). The University of Wisconsin-Madison is one of the oldest public schools and ranked third among public schools in the US for scientific research. The School of Biomedical Engineering at the school is also ranked top 10 for scientific research and training.\nThe goal of the Biomedical Engineering Advanced Program is to create a flexible, flexible training program that allows learners to access the latest developments in the field of Biomedical Engineering; provide learners with specialized technical knowledge, develop inference, research and solve common problems between engineering science and biomedical science.\nThe Advanced Program in Biomedical Engineering is taught entirely in English and taught by lecturers from Hanoi University of Technology and foreign lecturers.\nLanguage of instruction: English\nAdmission form\n\n+ Talent screening\n+ Admission is based on high school graduation exam results\n+ Combined admission\n\n                            ", "Description_2": "\n                            Training Program\n                            (Download the program cirriculum HERE)\nKnowledge and skills obtained at graduation\nKnowledge \n\nGraduates will be able to apply deep and broad knowledge of mathematical and basic sciences, as well as of the speciality, together with the ability to employ methods and advanced tools in order to design, implement, operate and evaluate technological systems, products and solutions in the field of BME.\n\nSkills\n\nGraduates are equipped with \nTechnical skills and professionalism critical for success in their career; \nSocial skills needed for multidisciplinary team-work and international-standard environments; \nThe ability to identify problems and develop ideas, ability to design and implement, operate, apply and exploit systems, products and technical solutions in the field of BME. \n\nForeign language proficiency \n\nHave a high English proficiency in communications with a graduation criterion for TOEIC of at least 650. \n\nCourse timeframe and opportunity for higher education \n\nBachelor degree: 4 years \nCombined Bachelor – Engineer degree: 5 years \nCombined Bachelor – Master degree: 5.5 years \nCombined Bachelor – Master – Doctorate degree: 8.5 years\n\n                        \n                            Tuition - Scholarships\n                            In addition to scholarships and financial aids from HUST, students in the advanced BME course have opportunities to receive: \n\nFinancial aids and exchange scholarships from enterprises and oversea universities that are partners of the School of Electronics and Telecommunications. \nThe annual rate of students receiving scholarships to study in the USA, Europe, Japan, Singapore and Korea is more than 20% of all graduates.\n\n                        \n                            Careers\n                            Job opportunities after graduation \n100% students find jobs within 6 months after graduation with a starting salary of 8-20 million VND.\nTypical job positions\n\nResearch and development engineers, project managers, marketing staff for domestic and foreign companies and corporations in the field of Healthcare;\nEngineers working at the Department of Equipment and Instrumentation at hospitals and clinics throughout Vietnam;\nResearchers at universities and institutes in Vietnam...\n\nContact: School of Electronics and Telecommunications\n\nAddress: 405 - C9, Hanoi University of Science and Technology, No 1 Dai Co Viet, Hai Ba Trung, Hanoi \nHotline: 0904277585 (Dr. Nguyen Thai Ha); 0983444322 (Dr. Nguyen Viet Dung)\nEmail: bme.set@hust.edu.vn\nWebsite: http://set.hust.edu.vn / www.bme.hust.edu.vn\n\n \n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "IT-E15", "Recruiement": {"2020": {}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 40}}, "Description_1": "\n                                \n                                    Graduated: Bachelor\n                                    Admissions Time: 4 – 8 months annually\n                                    Training time: Bachelor (4 years) - Engineer (5.5 years), Master (5.5 years)\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                Cyber security (Advanced Program) (IT-E15) is a new program - the first in Vietnam at the university level - oriented to train experts, meeting the needs of highly qualified human resources of the Industry. 4.0 and the National Digital Transformation Strategy, the Cyber ​​Security program was designed by leading domestic and international professors, in collaboration with large technology corporations such as Bkav, IBM. 100% of subjects are taught in English. Students participating in the program are fully equipped with academic knowledge, while focusing on increasing the amount of practice time, as well as learning through experience at the system of research laboratories, as well as at universities. company, a corporation operating in the field of ICT in Vietnam and in the world.\nThe program provides foundational knowledge including application cryptography, software and system security, malware analysis, cyber attack prevention, digital forensics, biometric security, blockchain, and many other subjects. related to innovation skills, and entrepreneurship. Infrastructure for students' practice includes virtualization system with exercises from basic to advanced, system of incident response drills, system of attack and defense training ground, equipped with under the strategic cooperation agreement with Bkav Group and invested through the KOICA IBS project (Korea). Students experience the technologies that are the foundation to ensure the safety of the information systems of enterprises and of e-Government.\nFinal year students will be guided by experts who are alumni of the Institute of Information and Communication Technology working at leading technology corporations such as Bkav, IBM, Thales... to both improve their knowledge and supplement their knowledge. adding professional working skills, researching according to international standards, towards the global labor market.\n                            ", "Description_2": "\n                            Training Program\n                            [ Updating ]\nFor more information about this program, please contact:\nSchool of Information and Communication Technology\nP-501, Building B1, Hanoi University of Science and Technology, No. 1, Dai Co Viet, Hai Ba Trung, Hanoi, Vietnam\nTel: 02438692463;\nEmail: vp@soict.hust.edu.vn;\nWebsite: https://soict.hust.edu.vn\n                        \n                            Tuition - Scholarships\n                            Scholarships and financial aid\nIn addition to the scholarships and financial support of Hanoi University of Science and Technology, students enrolled in the Cyber ​​Security program with good academic results have the opportunity to receive talented scholarships from the Alumni Association / Business Association Scholarship Fund. IT or from big corporations like Bkav, IBM, Microsoft, Samsung, VNPT...\nStudents with good teaching and research skills can work as teaching assistants (Teaching Assistant - TA, supporting teachers), or research assistants (Research Assistant - RA, supporting and doing research together. research with teachers at the laboratory system of the Institute) with a salary of up to 4 million / month, accompanied by an official certificate of the Institute of Information and Communication Technology so that students will have favorable conditions to apply for scholarships later. study abroad.\nStudent exchange scholarships and internship opportunities\nAs part of the Elitech Programs block, the Cyber ​​Security program regularly invites professors and international experts to teach students. In addition, the Institute of Information and Communication Technology cooperates with prestigious universities in Europe, North America, and Japan, giving students the opportunity to exchange and early exposure to an international working environment, such as the University of Waikato (the University of Waikato). New Zealand), Nanyang Technological University (Singapore), National University of Singapore, Uppsala University (Sweden), Aizu University (Japan), Tokyo University of Technology (Japan)... , students can practice and experience the real working environment at more than 200 partner enterprises of the Institute, including many international businesses based in Vietnam. The Institute's alumni network in Silicon Valley also regularly organizes support and consulting activities to help students have the opportunity to exchange and practice at the world's leading technology corporations.\n \n                        \n                            Careers\n                            Cyberspace is considered a new territory and ensuring cyber safety plays a vital role for socio-economic development, so Cyber ​​Security experts are currently the hottest profession in the world. , with a salary that is superior to other industries in the IT field. Graduates can work:\n\nIn the operation and safety network management departments, participating in incident response and analytical investigation at multinational corporations, banks, state agencies and organizations.\nIn software development departments, providing safe digital services to people and businesses, contributing to the successful implementation of the National Cybersecurity Strategy, developing e-Government towards Digital Government.\nStarting a business, developing applications, integrating/manufacturing equipment to detect, prevent and prevent network intrusion attacks, malicious code attacks, ensure software and information system security.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Công nghệ thông tin và Truyền thông\n                            \n                                Address: Văn phòng Trường CNTT&TT (P505 - Nhà B1)\n                                Hotline: \n                                    024 3869 2463\n                                    \n                                Email: vp@soict.hust.edu.vn\n                                Website: https://soict.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "ET-E4", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \nAdvanced Program in Electronics and Telecommunications Engineering (ET-E4)\nET-E4 is a Bachelor of Electronics - Telecommunications training program taught in English with the orientation of training learners with solid professional knowledge, professional working skills, and the ability to integrate well with the international working environment.\nEach semester, ET-E4 has at least one subject visited by professors from universities around the world, who is a long-term cooperation partner of Electronics - Telecommunications, HUST, with topics on Computer Networks and IoT, Telecommunications Networks, Radio Communications, Artificial Intelligence and Applications...\nWith an undergraduate program studied entirely in English, an internationalized environment, ET-E4 students have an advantage in the process of applying for graduate study abroad scholarships. Statistics from K54 – K61, about 20% of ET-E4 students study abroad after graduate studies (Master, PhD) at major universities in Asia (KAIST - Korea, Tsinghua University - Taiwan), Europe (VUB, KU Leuven - Belgium, Germany, France,..), the US ...\nLanguage of instruction: English\nAdmission form\n\nDirect Selection (Talent Screening)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of a thinking test\n\n \n                            ", "Description_2": "\n                            Training Program\n                            Students enrolled in the advanced program in Electronics and Telecommunications Engineering are equipped with specialized knowledge and skills in:\n\nComputer networks, IoT, new generation information networks, 5G mobile networks – Design, build and optimize information network system solutions and program communication protocols between network devices,\nRadio communication technology, mobile communication – Development of solutions, technologies and equipment in telecommunication networks, mobile,\nInformation and communication equipment – Design of electronic equipment and hardware programming,\nSpecialized English and English communication proficiency, and professional working skills in an international, multicultural environment.\n\nGraduates of the advanced training program Electronics - Telecommunications Engineering are capable of performing jobs in:\n\nConsulting, designing and developing integrated solutions for radio communication systems, access network systems, core network information systems, mobile networks,\nResearch, design, manufacture, and verify information equipment, measuring equipment in the field of electronics, information and modern information transmission equipment.\nManage and supervise technical projects in the field of electronics, communications-information.\n\nJOB OPPORTUNITIES\nTypical job positions after graduating from the advanced program of Electronics - Telecommunications Engineering:\n\nDesign and operation engineers in domestic and foreign companies and industrial groups in the fields of Electronics, Telecommunications,\nDesign engineers at design consulting companies, solution development,\nResearch and development staff at research centers, research institutes and foreign universities in the field of Electronics - Telecommunications.\n\nEnterprises attracting Electronics - Telecommunications human resources:\nViettel, VNPT, Vinaphone, Mobiphone, VDC, FPT, Samsung, Siemens, Ericssons, ACE, DASAN, Toshiba, Panasonic, HCL, Qorvo, Dolphin\nSCHOLARSHIP\n\nGood scholarships and financial support of USTH\nShort-term exchange scholarships of enterprises and international universities that are partners of the School of Electrical and Electronics, Electronics - Telecommunications\n\nIn charge of in-depth consulting on e-commerce:\n\nET-E4 website: https://seee.hust.edu.vn/ete4\nFB fanpage ET-E4: https://www.facebook.com/SET.ETE4\nDirector of Investment: Dr. Phung Thi Kieu Ha; \nEmail: ha.phungthikieu@hust.edu.vn; \nPhone: 0918 34 36 23\n\n                        \n                            Tuition - Scholarships\n                            In addition to scholarships and financial aid of HUST, students enrolled in the Advanced Program on Electronics and Telecommunications have the opportunity to receive:\n\nStudents have the opportunity to receive scholarships from the University, student exchange scholarships from businesses and international universities that are partners of the Institute of Electronics and Telecommunications. The proportion of students studying abroad with scholarships annually accounts for over 20% of the total number of graduates.\n\nPost-graduation job opportunities\n\n\nEngineers working in the field of Telecommunications Engineering such as fixed or mobile network service providers, ISPs. Software development engineer, hardware design and embedded systems.\n\n\nResearch and development engineer in the fields of telecommunications, Internet, hardware and software for smart devices such as mobile devices, IoT devices, medical devices.\n\n\nEngineer operating telecommunication network systems, industrial electronic systems.\n\n\nSolution consultant, sales of electronic and telecommunication products.\n\n\n100% of students have jobs after 6 months of graduation with a starting salary of 12 million to 20 million VND/month.\n\n\nTraining Program Details - SEE HERE\n\nDetailed Electronic Engineering Training Program (Advanced Program) DOWNLOAD PDF\nDetailed Telecommunications Engineering Training Program (Advanced Program) DOWNLOAD PDF\nHigher Education Framework (Vietnamese-English Bilingual)   DOWNLOAD PDF\nSyllabus of the curriculum   DOWNLOAD XLS\n\n                        \n                            Careers\n                            \nEngineer network design and optimization, network management, operation of complex telecommunication network systems.\nEngineers design and write software for computers, design and write software for smart devices such as mobile phones, robots, cars, digital TV receivers ..., software test engineers.\nIC Design Engineer, IC Testing\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "ET-E16", "Recruiement": {"2020": {}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 60}}, "Description_1": "\n                                \n                                    Graduated: Bachelor\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \n\n\n(Click vào ảnh để tải về bản .PDF)\nMultimedia engineering is the study and application of techniques for collecting, processing, creating content and communicating multimedia data/information such as text, graphics, images, sound, animation, animation, video. This is an important bridge between information technology and electronics to create products that meet the central requirements of the industrial revolution 4.0.\n                            ", "Description_2": "\n                            Training Program\n                            Bachelors/Masters in Digital Communication and Multimedia are equipped with: a solid foundation of Math and science to ensure the ability to self-educate to improve professional qualifications; deep specialized knowledge and broad interdisciplinary knowledge to participate in the creative design and development of technical solutions to solve real-life problems in the field of multimedia and digital communication; Basic knowledge of fine arts, painting, media, culture, administration and management. Besides, engineers are equipped with skills in searching, analyzing, evaluating and detecting problems; systems thinking, teamwork skills, etc. With the knowledge and skills equipped, the bachelor/master in Digital Communication and Multimedia Engineering plays an important role in 3 main areas:\n+ Multimedia big data analysis, representation and mining based on artificial intelligence technologies\nAnalyze, understand and synthesize data (photos, text, video, audio)Visualize, analyze, manage and mine multimedia big data\n+ Create digital content and develop multimedia systems\nArt design, graphics, effects, virtual and augmented reality, etc.Develop multimedia applications for end users: web, mobile applications, games, media publications, etc.Development of multimedia intelligent systems: robots, autonomous vehicles, drones, smart homes, etc.\n+ Digital Communication and Intelligent Computing\nSignal processing (encoding, compression), multimedia communication ensures quality of serviceHigh-speed telecommunications networks and systems and wireless communication: IoT and 5G technologiesCloud computing, fog computing, edge computing\n                        \n                            Tuition - Scholarships\n                            In addition to scholarships and financial support from Hanoi University of Science and Technology, students majoring in Digital Communication and Multimedia Engineering have the opportunity to receive:\n\nThe scholarship is for students with difficult circumstances, students with excellent achievements in study and scientific research.\nStudents are supported and facilitated to be able to apply for scholarships from international scholarship funds and the opportunity to exchange and practice abroad.\nJoin as teaching assistant, or research assistant\n\nStudent exchange scholarships and internship opportunities\n\nStudents have the opportunity to participate in study exchange, research and transfer programs at prestigious partner schools in France, Japan, UK, etc.\nIn addition, during the process, students can practice and experience the real working environment at corporations, enterprises, research institutes partners of the Institute.\n\n                        \n                            Careers\n                            \nEngineers, designers: 3D, animation, games, movies, web, ...\nR&D engineer, data analysis: photos, videos, audio, natural language, ...\nDigital communication model development engineer: 5G, edge / cloud\nManage and edit multimedia projects: movies, advertisements,\nResearch, teaching and management staff at agencies and organizations (universities, research institutes) related to Digital Communication and Multimedia Technology\nCommit 100% of students to have a job after 1 year of graduation with a salary of 12-20 million VND/month.\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "},
{"Training language": "Tiếng Anh", "Admission code": "EE-E8", "Recruiement": {"2020": {"Talent recruitment": null, "Admissions targets": null}, "2021": {"Talent recruitment": null, "Admissions targets": null}, "2022": {"Talent recruitment": null, "Admissions targets": null}, "2023": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 100}, "2024": {"Talent recruitment": "Xét tuyển bằng Giải thưởng HSG QG-QT/Chứng chỉ Quốc tế/HSNL", "Admissions targets": 120}}, "Description_1": "\n                                \n                                    Graduated: Bachelor – Masters – PhD (NCS)\n                                    Admissions Time: 8 months annually\n                                    Training time: 4 - 5.5 - 8.5 years\n                                    Tuition: 40 - 45 million VND/year\n                                \n                                 \nThe advanced program Control-Automation Engineering and Electrical Systems aims to directly meet the increasing demand for human resources in the field of Electrical Engineering, Control Engineering and Automation. Many generations of teachers and students have actively participated in the development of Vietnam's electricity industry, modernization of industrial factories and modern technology transfer, development of measurement centers of regions and ministries. Students who are trained after graduation can continue to improve and improve their professional qualifications in units such as:\n\nIndustrial enterprises belonging to Vietnam Electricity Corporation, Cement Corporation, Oil and Gas Corporation, General Department of Standard Metrology, Equipment Manufacturing Enterprises\nForeign companies working in the field of electricity: companies of SIEMENS, ABB, GE, Schneider Electric, Tabuchi, Mitsubishi, Canon ,...\nResearch institutes related to the field of madness: Institute of Energy, Institute of Metrology, Institute of Information Technology, Institute of Physics, Institute of Machine Mechanics, Institute of Automation\n\nIn addition, there are many opportunities to continue studying, improve professional qualifications at home and abroad at higher education levels, and join scientific research and development organizations and training. Studied in the environment of Electrical Institute, one of the first units established of Hanoi University of Science and Technology (1956). Through some changes in the organizational structure as well as management methods of the University, in December 12, the Faculty of Electrical Engineering was transformed into the School of Electrical Engineering. The Institute of Electricity has a prestige and tradition in the field of training, scientific research and technology transfer. Over 2010 years of construction and growth, generations of teachers and students are always proud to have contributed significantly to the construction of the country.\nHighlights\nThe training program is developed and developed according to American training programs (San Jose University) in accordance with Vietnamese practice. Students are equipped with knowledge of: Measurement techniques and intelligent sensor systems; Industrial communication network systems; Programming techniques for microcontroller chips, microprocessors; Traditional and modern control methods; Programming automation of industrial production lines; Power electronic control and electric drive; Robot Control Engineering; Wireless sensor network; Neural network engineering and artificial intelligence (AI); Power grids and power systems; Protection and stability of the power system; Electric cars; Renewable energy...\nThe program is built in cooperation with the University of Dortmund - Germany, Shibaura University - Japan, TU-Dresden - Germany, Bordeaux INP - France ... other to be able to continue to receive degrees at these schools and continue their studies at higher levels.\nLanguage of instruction: English\nAdmission form\n\nDirect Selection (Talent Screening)\nAdmission is based on high school graduation exam results\nAdmission is based on the results of the Thinking Assessment Test\n\n                            ", "Description_2": "\n                            Training Program\n                            Detailed  Training Program Information  DOWNLOAD PDF\nIn charge of in-depth consulting on e-commerce:\n\nEE-E8 - Control and Automation Engineering (Advanced Program)\nDirector of Investment: Dr. Nguyen Thanh Huong\nEmail: huong.nguyenthanh3@hust.edu.vn\nPhone: 0904 466684\n\n                        \n                            Tuition - Scholarships\n                            Students have the opportunity to receive scholarships from BKU, scholarships from domestic and foreign companies and corporations ABB, Siemens, Mitsubishi, Fuji, Rockwell Automation..., funding to support internships at Foxconn, Coteccons, Samsung, EDH, EVN, ... scholarships for student exchange abroad under the following programs: Erasmus, AUN/SEED-Net, TFScale ...\nThere are opportunities to study scholarships to continue studying at higher levels in the country and in the US, Europe, Australia, Canada, Japan, Singapore, Korea from Vingroup, the Ministry of Education and Training of Japan, Korea, Europe, research labs in cooperation with the Institute of Electricity.\nContact the Program Coordinator: \nTS. Nguyen Thanh Huong \nEmail: huong.nguyenthanh3@hust.edu.vn \nFacebook program: https://www.facebook.com/chuongtrinhtientien\n                        \n                            Careers\n                            100% of students have jobs after 01 year of graduation or go to higher education\nGraduates of Control and Automation Engineering programs can take on jobs in different roles such as:\n\nProject Management Engineer; Design and development engineer; Operation and maintenance engineers; Inspection and evaluation engineers; Design consultancy, supervision; Sales and marketing engineer\nHave the opportunity to work interviews right after graduation at large corporations and companies such as Samsung, LG, General Electric, ABB, Siemens, Schneider Electric, Mitsubishi, Canon, EVN, Viettel, Vingroup, BKAV\nGraduates also have many opportunities to apply for scholarships to study in the US, Europe, Japan, Singapore, Korea (20-30% of total graduates annually receive scholarships to study abroad)\nAbility to work at research centers, research institutes and universities in the US, Europe, Japan, Singapore, Korea\n\n                        ", "Management": "\n                            Management Unit\n                            Trường Điện - Điện tử (SEEE) \n                            \n                                Address: Văn phòng: C1 - 320\n                                Hotline: \n                                    024 3869 6211\n                                     & 024 3623 1478\n                                Email: seee@hust.edu.vn\n                                Website: https://seee.hust.edu.vn/\n                            \n                        "}
]